

{
  "processor": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/amd/5600x/5600x-001-500x500.jpg",
      "productName": "AMD Ryzen 5 5600 Processor",
      "category": "Processor",
      "description": "AMD Ryzen 5 5600 Processor has 6 processor cores, 12 threads, and an astonishingly efficient 45-65W TDP. This processor stands with 3.5GHz Base Clock, 4.4GHz Max Boost Clock, 3MB L2 Cache, 32 MB L3 Cache with AM4 Package, and TSMC 7nm FinFET CMOS. This processor is built with PCIe 3.0 x8 and Wraith Spire Thermal Solution. The AMD Ryzen 5 5600 Processor provides DDR4 Up to 3200MHz memory with 2 memory channels. It has AMD StoreMI Technology which is a fast and easy way to expand and accelerate the storage in a desktop PC with an AMD Ryzen processor. AMD StoreMI technology is a powerful tool for PC enthusiasts that want to improve load times, boot times, file management, or system responsiveness. Whatever your storage acceleration needs, AMD StoreMI technology automatically pairs your most-used files with an SSD cache for peak performance. MD StoreMI technology can get files running at SSD-like speeds. Simply add an SSD to your system and let StoreMI do the rest. It also has AMD 'Zen 3' Core Architecture with the fastest cores in the world for PC gamers. The 'Zen 3' architecture represents the most comprehensive design overhaul of the 'Zen' era. Over 20 major changes include wider and more flexible execution resources; significantly more load/store bandwidth to feed execution; and a streamlined front-end to get more threads in flight and do it faster. The 'Zen 3' architecture can extract an average of 19% additional performance from every MHz of frequency relative to the previous generation2. This is a historically large generational improvement in IPC and a major player in this architecture's ability to deliver unmatched single-core performance. The 'Zen 3' architecture transitions to a new 'unified complex' design that brings 8 cores and 32MB of L3 cache into a single group of resources. This dramatically reduces core-to-core and core-to-cache latencies by making every element of the die a next-door neighbor with minimal communication time. Latency-sensitive tasks like PC gaming especially benefit from this change, as tasks now have direct access to twice as much L3 cache versus the Zen 2. It also features the AMD Ryzen VR-Ready Premium for the best possible VR experience possible. AMD Ryzen 5 5600 Processor offers a 3-Year Warranty.",
      "price": "14300",
      "status": "In Stock",
      "rating": 4.5,
      "keyFeatures": {
        "brand": "Ryzen",
        "model": "Ryzen 5 5600",
        "speed": "3.5GHz up to 4.4GHz",
        "cache": "L2: 3MB, L3: 32MB; Cores-6 & Threads-12"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/intel/core-i3-13100/core-i3-13100-01-500x500.webp",
      "productName": "Intel 13th Gen Core i3-13100F Raptor Lake Processor",
      "category": "Processor",
      "description": "The Intel 13th Gen Core i3-13100F Raptor Lake Processor is a quad-core, eight-thread processor with a base clock speed of 3.40 GHz and a maximum turbo frequency of 4.50 GHz. It features 12 MB of L3 cache and is compatible with the LGA 1700 socket. It is a part of Intel's 13th generation of processors built on the Raptor Lake architecture. It is designed for use on desktops and workstations. The Intel Core i3-13100F is compatible with LGA 1700 socket motherboards with the Intel 600 or 700 series chipset. It comes with support for PCI Express 5.0 and dual-channel DDR5 memory at 4800 MHz, making it ideal for office applications.",
      "price": "14000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Core i3-13100F",
        "speed": "3.40 GHz up to 4.50 GHz",
        "cache": "12 MB"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/i3-10100/i3-10100-500x500.jpg",
      "productName": "Intel 10th Gen Core i3 10100 Processor",
      "category": "Processor",
      "description": "This processor comes with a new breed that come with an enabled integrated GPU, so a separate graphics card is not required for its functionality. This new 10th gen Comet Lake microarchitecture is manufactured with the 14nm process that comes with four cores but lacks in HyperThreading. As this chip is updated to the latest BIOS revision, it nicely fits into any Intel 300-series motherboard. Focusing on this, all the major motherboard manufacturers have already started BIOS updates for their 300-series lineup",
      "price": "11300",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Intel Core i3 10100",
        "speed": "3.60 up to 4.30 GHz",
        "cache": "6M Cache"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/AMD/ryzen-3-4100/amd-ryzen-3-4100-01-500x500.jpg",
      "productName": "AMD Ryzen 3 4100 Processor",
      "category": "Processor",
      "description": "AMD Ryzen 3 4100 Processor has 4 processor cores, 8 threads, and an astonishingly efficient 45-65W TDP. This processor stands with a Base Clock of 3.8GHz and a Maximum Boost Clock of 4.0GHz. It has 256KB L1 Cache. 2MB L2 Cache, 4MB L3 Cache with AM4 Package, and TSMC 7nm FinFET CMOS. This AMD processor is built with PCIe 3.0 x8 and Wraith Spire Thermal Solution. This Processor provides DDR4 Up to 3200MHz memory with 2 memory channels. It has AMD StoreMI Technology, AMD 'Zen 2' Core Architecture, and AMD Ryzen VR-Ready Premium. The built-in AMD StoreMI Technology is a fast and easy way to expand and accelerate the storage in a desktop PC with an AMD Ryzen processor. AMD StoreMI technology is a powerful tool for PC enthusiasts that want to improve load times, boot times, file management, or system responsiveness. Whatever your storage acceleration needs, AMD StoreMI technology automatically pairs your most-used files with an SSD cache for peak performance. AMD StoreMI technology can get files running at SSD-like speeds. Simply add an SSD to your system and let StoreMI do the rest. It also features the AMD Ryzen VR-Ready Premium for the best possible VR experiences. It comes with Wraith Stealth Cooling Solution. These AMD Ryzen processors are designed to bring you the ultimate, high-performance computing experience. The latest revolutionary AMD multi-threaded processing technology gives you blazing fast performance when you work or play. This AMD Processor. Support AMD Socket AM4 Socket With AMD SenseMI technology and Powerful Overclocking Utility for AMD Ryzen processor. AMD Ryzen 3 4100 Processor offers a 3-years warranty(No Warranty for Fan or Cooler)",
      "price": "10300",
      "status": "In Stock",
      "rating": 4,
      "keyFeatures": {
        "brand": "Ryzeb",
        "model": "Ryzen 3 4100",
        "speed": "3.8GHz; Up to 4.0GHz",
        "cache": "256KB; L2 Cache: 2MB; L3 Cache: 4MB"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/core-i5-13600k/Core%20i5%2013600K-01-500x500.webp",
      "productName": "Intel 13th Gen Core i5 13600K Raptor Lake Processor",
      "category": "Processor",
      "description": "The Intel Core i5-13600K 3.5 GHz 14-Core LGA 1700 Processor will boost your productivity, gaming, and content production. This 13th-generation desktop CPU expands on the Hybrid Core design and Intel 7 process by packing 14 cores onto a single chip, four more than the prior generation, while still fitting the LGA 1700 socket. The Core i5-13600K is designed to deliver powerful performance for everyday workloads, with eight low-voltage Efficient-cores handling background tasks for multitasking and six 3.5 GHz Performance-cores powering programs and games. The built-in Intel Thread Director guarantees that the two function in unison by dynamically and intelligently distributing tasks to the appropriate core at the appropriate moment. With 24MB of cache and a Turbo Boost Max 2.0 clock of 5.1 GHz, this CPU is designed to handle a wide range of workloads. This CPU may also be overclocked for increased performance. PCI Express 5.0 and dual-channel DDR5 ECC memory at 5600 MHz are also supported by the Core i5-13600K. The Core i5-13600K has integrated Intel UHD 770 Graphics. It provides quick, rich 3D performance for high-quality images, with support for one 7680 x 4320 resolution 8K monitor or up to four 3840 x 2160 resolution 4K monitors with great dynamic range. The Intel 13th Gen Core i5 13600K Processor comes with a 03-year warranty.",
      "price": "36000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Core i5 13600K",
        "speed": "3.50 GHz up to 5.10 GHz",
        "cache": "24 MB, Socket: LGA1700"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for High budget"
        }
      ]
    }
  ],
  "motherboard": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/msi/pro-b660m-g-ddr4/pro-b660m-g-ddr4-01-500x500.jpg",
      "productName": "MSI PRO B660M-G DDR4 12th Gen mATX Motherboard",
      "category": "Motherboard",
      "description": "MSI PRO B660M-G DDR4 motherboard supports with 12th Gen Intel Core, Pentium Gold and Celeron processors for LGA 1700 socket, DDR4 Memory, up to 4600+(OC) MHz. This motherboard comes with premium layout and digital power design to support more cores and provide better performance. In thihs bmotherboard, the Advanced technology to deliver pure data signals for the best performance, stability and compatibility. It has PCIe 4.0, Lightning Gen4 x4 M.2 with M.2 Shield Frozr. With 2.5G LAN, This 2.5Gbps LAN provides incredible data transfer speed faster than general Gigabit LAN. This is a premium solution for demanding users. You can Upgraded network solution for professional and multimedia use and also it Delivers a secure, stable and fast network connection. This motherboard comes with Steel Armor, which helps to Protecting VGA cards against bending and EMI for better performance, stability and strength. The latest MSI PRO B660M-G DDR4 motherboard offers 03 year warranty.",
      "price": "16499",
      "status": "In Stock",
      "rating": 4,
      "keyFeatures": {
        "brand": "MSI",
        "model": "PRO B660M-G DDR4",
        "Supported processors": "12th Gen Intel Core, Pentium Gold & Celeron processors",
        "Supported memory": "DDR4, up to 4600+(OC) MHz",
        "Graphics Output": "2 x DisplayPort, 1 x VGA, 1 x HDMI"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/asus/pro-b760m-c-csm/pro-b760m-c-csm-01-500x500.webp",
      "productName": "ASUS PRO B760M-C-CSM 13th Gen Micro-ATX Motherboard",
      "category": "Motherboard",
      "description": "The ASUS PRO B760M-C-CSM is a 13th gen micro-ATX motherboard designed for business use. It supports Intel's LGA1700 socket, making it compatible with 13th Gen Intel Core processors as well as 12th Gen Intel Core, Pentium Gold, and Celeron processors. The motherboard features the Intel B760 chipset and supports up to 192GB of DDR5 memory with speeds up to 6200(OC). It has four DIMM slots with support for dual-channel memory architecture and Intel Extreme Memory Profile (XMP). The Pro B760M-C-CSM provides multiple connectivity options, including 2 x DisplayPort, 1 x VGA port, and 1 x HDMI port. It offers expansion slots such as 1 x PCIe 4.0/3.0 x16 and 2 x PCIe 3.0 x1 for additional devices. Storage options include 2 x M.2 slots and 4 x SATA 6Gb/s ports, and it also features 1 x Intel 1Gb Ethernet port for network connectivity. The motherboard offers various USB ports, audio support with a Realtek 7.1 Surround Sound High Definition Audio CODEC, and comes with ASUS Q-Design features for easy installation and maintenance. It is designed with business-focused features like ASUS Self Recovering BIOS, ASUS Event Log, and 24/7 reliability. The ASUS PRO B760M-C-CSM is a reliable and feature-rich motherboard suitable for business users in need of a compact form factor.",
      "price": "19800",
      "status": "In Stock",
      "rating": 4.5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "PRO B760M-C-CSM",
        "Supported processors": "13th Gen & 12th Gen Processors (LGA1700)",
        "Supported memory": "4 x DIMM, Max. 192GB, DDR5 6200(OC)",
        "Graphics Output": "2 x DisplayPort, 1 x VGA, 1 x HDMI"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/asus/tuf-gaming-b650-plus/tuf-gaming-b650-plus-01-500x500.webp",
      "productName": "Asus TUF GAMING B650-PLUS DDR5 AM5 ATX Motherboard",
      "category": "Motherboard",
      "description": "The Asus TUF GAMING B650-PLUS Motherboard combines all of the necessary components of the newest AMD Ryzen 7000-series CPUs with game-ready features and proven endurance. This motherboard exceeds expectations with rock-solid and reliable performance for marathon gaming, thanks to military-grade components, an enhanced power solution, and a sophisticated cooling system. TUF GAMING motherboards are also subjected to extensive durability testing to guarantee that they can withstand situations that might cause other motherboards to fail. This model has tough off-black and geometric design elements to highlight the durability and stability that characterize the TUF GAMING line. This Asus TUF GAMING B650 motherboards offer a feature-rich high-performance gaming package that includes ultrafast networking for smoother online gameplay, pristine audio with positional cues for FPS gaming, and onboard RGB lighting that syncs with attached gear to personalize your gaming environment. To experience superior performance, build your next setup using an AMD Ryzen 7000 Series processor and ASUS TUF GAMING motherboards. The AMD Ryzen 7000 Series puts you ahead of the game with up to 16 'Zen 4' cores and 32 threads, peak frequencies of up to 5.7GHz, and an 80MB cache. With AMD Socket AM5, you'll also have access to additional capabilities for gamers, such as DDR5 memory speed and PCIe 5.0 improved bandwidth. AMD Ryzen 7000 Series CPUs and AMD socket AM5 motherboards are overclockable, allowing you to customize your experience. Overclock your DDR5 memory with AMD EXPO technology to get even greater performance.",
      "price": "30000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "TUF GAMING B650-PLUS",
        "Supported processors": "Ryzen 7000 Series Processors for Socket AM5",
        "Supported memory": "4x DDR5, up to 128GB, 6400+(OC)",
        "Graphics Output": "1x HDMI, 1x Display Port"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/gigabyte/z790-aorus-elite-ax/z790-aorus-elite-ax-01-500x500.webp",
      "productName": "GIGABYTE Z790 AORUS ELITE AX 13th & 12th Gen ATX Motherboard",
      "category": "Motherboard",
      "description": "The GIGABYTE Z790 AORUS Elite AX ATX Motherboard comes with Intel Socket LGA 1700 that supports 13th and 12th Gen Series Processors. It delivers unparalleled performance with twin 16+1+2 Phases Digital VRM Solution. The motherboard comes with 4x SMD DIMMs with XMP 3.0 Memory Module Support. It offers support for DDR5 7600(O.C.) /7400(O.C.) /7200(O.C.) /7000(O.C.) /6800(O.C.) /6600(O.C.) / 6400(O.C.) / 6200(O.C.) / 6000(O.C.) / 5800(O.C.) / 5600(O.C.) / 5400(O.C.) / 5200(O.C.) / 4800 / 4000 memory modules. The sockets support up to 128 GB (32 GB single DIMM capacity) of system memory. The motherboard is equipped with the PCIe 5.0 x16 slot and M.2 socket designed to optimize multitasking and large workloads, which is also ready for a new PCIe 5.0 graphics card or storage device. It supports new PCIe 5.0 SSD with up to type 25110 M.2 slot designed to provide high power M.2 PCIe 5.0 SSD solutions. The GIGABYTE Z790 AORUS ELITE AX is equipped with Intel 2.5Gb Ethernet provides an immediate boost to overall network performance, smooth video editing, and fast data transfers. Wi-Fi 6E brings the ability to conduct AR/VR experiences, get creative with fewer dropped connections, and download large files at faster speeds without lag. The advanced cooling solution also provides the perfect aesthetic heatsink design to keep your PC at an optimal temperature, preventing you from unexpected system crashes during the creative process. The GIGABYTE Z790 AORUS ELITE AX ATX Motherboard comes with 3 years of warranty.",
      "price": "40500",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "Z790 AORUS ELITE AX",
        "Supported processors": "13th Gen & 12th Gen Processors (LGA1700)",
        "Supported memory": "4 x DDR5 DIMMs, up to 7600(O.C.)",
        "Graphics Output": "1 x HDMI, 1 x DisplayPort"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/msi/meg-x670e-ace/meg-x670e-ace-01-500x500.webp",
      "productName": "MSI MEG X670E ACE DDR5 AMD AM5 E-ATX Motherboard",
      "category": "Motherboard",
      "description": "The MSI MEG X670E ACE Motherboard supports AMD's Ryzen 7000-series processors with up to 16 Zen 4 cores as well as dual-channel DDR5 memory, Maximum Memory Capacity of up to 128GB. It features a 22+2+1 phases power design with 90A Power Stage and dual CPU power connectors ready to unleash the maximum performance. It has a stacked Fin Array, Direct Touch VRM Heat-pipe, MOSFET Baseplate, 7W/mK thermal pads, double-sided M.2 Shield Frozr, and Frozr AI software to ensure extreme performance with low temperature. The motherboard is made of an 8 Layer PCB with 2oz Thickened Copper that provides higher performance and long-lasting system stability without any compromise. The MSI MEG X670E ACE offers onboard and exclusive M.2 XPANDER-Z GEN5 DUAL PCI-Express card offer totally sextuple M.2 connectors for maximum storage performance. It can deliver a lightning-fast game experience with PCIe 5.0 slots, Lightning Gen 5 x4 M.2, Front USB 3.2 Gen 2x2 20G with 60W USB Power Delivery. The double-sided Shield Frozr design keeps M.2 SSDs safe while preventing throttling, making them run faster. The rear I/O panel now offers easy ways of directly entering the safe boot, a one-click toggle for all RGB lights, and directly activating Turbo mode. The MSI MEG X670E ACE Motherboard offers 2x PCIe Gen 5 x16 slots and 4x M.2 slots. The MEG series offers a stacked fin array heatsink and a heatpipe along with a MOSFET baseplate for effective heat dissipation from the VRMs. The MSI MEG X670E ACE comes with 3 years of warranty.",
      "price": "97000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "MSI",
        "model": "MEG X670E ACE",
        "Supported processors": "Ryzen 7000 Series Processors for Socket AM5",
        "Supported memory": "4x DDR5, Max 128GB",
        "Graphics Output": "1x Type-C Display port"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an out standard motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    }
  ],
  "ram": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/vengeance-rgb-rs/vengeance-rgb-rs-01-500x500.webp",
      "productName": "CORSAIR VENGEANCE RGB RS 8GB DDR4 3600MHz RAM",
      "category": "Ram",
      "description": "The CORSAIR VENGEANCE RGB RS 8GB DDR4 3600MHz RAM features individually addressable RGB lighting while delivering outstanding performance optimized for Intel and AMD motherboards. It is compatible with Intel 300 Series, Intel 400 Series, Intel 500 Series, Intel 600 Series, AMD 300 Series, AMD 400 Series, and AMD 500 Series. Illuminate your system with dynamic RGB lighting from six individually addressable RGB LEDs, encased in a panoramic light pipe that offers unobstructed viewing from virtually every angle. This desktop RAM features a beautifully designed aluminum heat spreader that conducts heat away from your memory for superb cooling even when overclocked, with modern styling to complement your RGB lighting. It has been engineered for performance with a custom high-performance PCB and carefully screened memory chips deliver maximum bandwidth and tight response times. The CORSAIR VENGEANCE RGB RS comes with a lifetime warranty.",
      "price": "4200",
      "status": "In Stock",
      "rating": 4.3,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "VENGEANCE RGB RS",
        "frequency": "3600Mhz",
        "capacity": "8GB (1 x 8GB)",
        "voltage": "1.25V/C36"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/gskill/trident-z-neo/trident-z-neo-001-500x500.jpg",
      "productName": "G.Skill Trident Z NEO RGB 32GB DDR4 3600MHz Gaming Desktop RAM",
      "category": "Ram",
      "description": "The latest G.Skill Trident Z NEO RGB Gaming Desktop RAM brings unparalleled memory performance and vibrant RGB lighting to any gaming PC or workstation with latest AMD Ryzen CPUs and AMD DDR4 motherboards, It engineered and optimized for full compatibility on the latest AMD Ryzen platforms. This RAM is designed for memory performance with the latest AMD Ryzen platforms, Trident Z Neo is optimized to unlock the full potential of the AMD platform to its maximum speed and also featured with a contrast of black brushed aluminum and powder-coated silver, the Trident Z Neo dual-toned heatspreader adds power and boldness to your next-gen build. The Trident Z Neo features a beveled edge along the top of the signature tri-fin design with the asymmetrical slant to achieve a sleek and clean look. It is crafted with hand-screened memory ICs and custom 10-layer PCBs, each and every module is made for maintaining the best signal integrity to achieve fast overclocking performance. This RAM is fully control and customize the 8-zone RGB lighting through the downloadable Trident Z Lighting Control software.",
      "price": "11800",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "G.Skill",
        "model": "Trident Z NEO RGB",
        "frequency": "3600MHz",
        "capacity": "32GB",
        "voltage": "1.35V; unbuffered"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/vengeance-rgb/vengeance-rgb-01-500x500.webp",
      "productName": "Corsair VENGEANCE RGB 32GB (2x16GB) DDR5 5600MHz C36 AMD EXPO RAM Kit",
      "category": "Ram",
      "description": "The Corsair VENGEANCE RGB 32GB (2x16GB) DDR5 5600MHz C36 AMD EXPO RAM Kit is a high-performance memory kit designed for AMD motherboards. With a capacity of 32GB, it provides ample memory for demanding tasks and applications. The DDR5 technology ensures faster data transfer rates and improved overall performance compared to its DDR4 counterparts. Operating at a frequency of 5600MHz, this RAM kit delivers exceptional speed and responsiveness, allowing for smooth multitasking and seamless gaming experiences. The 288-pin form factor ensures compatibility with most modern motherboards, providing easy installation and setup. The voltage and CAS latency of the Corsair VENGEANCE RGB DDR5 RAM is optimized for efficient performance. With a voltage of 1.25V and a CAS latency of C36, the RAM operates at an optimal power level while maintaining low latency for faster data access. This RAM kit is the ten-zone RGB lighting. The RGB lighting adds a vibrant and customizable visual element to your PC, allowing you to personalize the aesthetics and create stunning lighting effects. You can sync the lighting with other compatible RGB components to create a unified lighting theme throughout your system. The Corsair VENGEANCE RGB 32GB DDR5 RAM Kit is an excellent choice for users who prioritize performance and aesthetics. It offers high-speed DDR5 memory, optimized for AMD motherboards, and features customizable RGB lighting to enhance the visual appeal of your cutting-edge PC build.",
      "price": "17500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "VENGEANCE RGB",
        "frequency": "DDR5 5600MHz",
        "capacity": "32GB",
        "voltage": "1.25V/C36"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/dominator-platinum-rgb-ddr5/dominator-platinum-rgb-01-500x500.webp",
      "productName": "Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit",
      "category": "Ram",
      "description": "The Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit is a high-performance memory kit designed for gaming enthusiasts and content creators. With the advent of DDR5 technology, this RAM kit offers unprecedented processing speed, allowing your high-end CPU to access data quickly and efficiently. No matter the task at hand, whether it's gaming, content creation, multitasking, or even opening numerous browser tabs, this RAM kit ensures that your gaming PC can handle complex tasks faster than ever before. It provides the power and control you need for demanding applications. The DOMINATOR PLATINUM RGB RAM kit features built-in voltage regulation, which, when combined with the iCUE software control, allows for easier and more precise voltage output adjustments. This feature contributes to more stable overclocking capabilities, enabling you to push your system's performance to its limits while maintaining stability. This RAM kit is the ability to save your own AMD EXPO profiles through the iCUE software. This eliminates the need for manually adjusting performance settings each time you switch tasks or applications. You can easily customize and tailor your setting profiles based on specific apps or tasks, enhancing overall efficiency and saving you time. Corsair ensures wide compatibility with their memory finder tool. This tool is integrated directly into the memory page, offering a user-friendly interface to help you find the best memory kit that suits your system's configuration. It provides a range of options to ensure compatibility, ensuring you are paired up with the most suitable memory kit for your needs. The Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit delivers exceptional performance, stability, and customization options. It is a reliable choice for users seeking top-tier memory modules to optimize their gaming and content creation experiences.",
      "price": "22500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "DOMINATOR PLATINUM RGB",
        "frequency": "DDR5 5200MHz",
        "capacity": "32GB (2x16GB)",
        "voltage": "1.25V/40-40-40-77"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/team/delta-rgb/delta-rgb-01-500x500.webp",
      "productName": "TEAM T-FORCE DELTA RGB 32GB (16GBx2) 7600MHz DDR5 Gaming RAM",
      "category": "Ram",
      "description": "The TEAM T-FORCE DELTA RGB DDR5 Desktop Gaming RAM comes with 32GB (16GBx2) capacity and 7600MHz  Speed. The RAM features RGB Colors & 120° Ultra-Wide Lighting, Power Management ICs (PMIC) Equipped for Stable, Efficient Power Usage Strengthened PMIC Cooling Design, and On-die ECC for Stable systems. This Gaming RAM supports Intel XMP3.0 for One-Click Overclocking. This RAM has High-Quality ICs Selected for Stability & Reliability. The TEAM T-FORCE DELTA RGB Desktop Gaming RAM is equipped with Smart RGB IC Controller that Supports Various Lighting Effect Software.",
      "price": "47798",
      "status": "In Stock",
      "rating": "4.5",
      "keyFeatures": {
        "brand": "T-FORCE",
        "model": "T-FORCE DELTA RGB DDR5",
        "frequency": "7600MHz",
        "capacity": "32GB (16GBx2)",
        "voltage": "1.25V/40-40-40-77"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an standard ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for High budget"
        }
      ]
    }
  ],
  "power-supply": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/Antec/neoeco-gold-650w/neoeco-gold-650w-01-500x500.webp",
      "productName": "Antec NeoEco Gold 650W Modular Power Supply",
      "category": "Power-supply",
      "description": "The new Antec NeoEco Gold 650W Modular Power Supply is designed for the most ardent DIY-PC enthusiasts, and it also provides great performance and stability. The NeoECO Gold Modular line, with its 100% complete modular design and 80 PLUS Gold certifications, keeps your PC hardware installation simple and clean. It continues to supply highly efficient power to your system while lowering your utility costs. The innovative thermal control with Zero RPM mode allows the fan to be turned off at low loads for complete silence. The NeoECO Gold Modular can improve the balance between cooling and noise with its 120mm quiet fan. High-quality Japanese heavy-duty caps provide more reliable performance for your system. The CircuitShield design provides industry-grade protection for your system, keeping it secure in any environment. It boasts a 120mm Silent Fan, improved airflow, and exceptional longevity. The Zero RPM fan mode also assures zero fan speed at low loads, reducing noise and maintaining total silence. The Antec NeoEco Gold 650W Modular Power Supply comes with a 07-year warranty.",
      "price": "8500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "NEOECO",
        "model": "NeoEco Gold 650W",
        "Certification": "80 Plus Gold",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "ATX 12V 2.4",
        "voltage": "100-240 VAC"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/corsair/rm1000e/rm1000e-01-500x500.webp",
      "productName": "Corsair RM1000e 1000W 80 Plus Gold Fully Modular Power Supply",
      "category": "Power-supply",
      "description": "The Corsair RM1000e is a Fully Modular Low-Noise Power Supply that provides your PC with quiet, consistent power with 80 PLUS Gold efficiency. RMe PSUs provide the connections needed to power today's demanding PC gear, including two 8-pin EPS12V cables and a variety of PCIe 8-pin power connectors. Industrial-grade, 105°C-rated capacitors provide excellent electrical performance and are covered by a seven-year guarantee. With support for the new Modern Standby sleep mode, you can wake up your computer faster and use less power. Fully modular cables make PC construction simple since you just connect the cables your system requires. The CORSAIR RMe Series offers consistent power for your system, with a 140mm-long shell that works with practically any current chassis.",
      "price": "18000",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "RM1000e",
        "Certification": "80 PLUS Gold Certification",
        "frequencyRange": "47 ~ 63 Hz",
        "modularType": "Fully",
        "voltage": ""
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/antec/signature-platinum-1300/signature-platinum-1300-01-500x500.jpg",
      "productName": "Antec Signature PLATINUM 1300 1300W 80 Plus Platinum Fully Modular Power Supply",
      "category": "Power-supply",
      "description": "The Antec Signature PLATINUM 1300 is an 80 Plus Platinum Power Supply that is equipped with superior features that ensure peak performance for the enthusiast and gaming-oriented segment, the Signature power supply Series boasts unparalleled stability and 80 PLUS Platinum-certified efficiencies. At 20% / 50% / 100% load AC 115V internal, the power efficiency should be at least 90% / 92% / 89%. It has an output capacity of 1300w. Advanced thermal control with the Zero RPM mode enables the optimal balance between silence and cooling. It ensures a longer-lasting and quieter system by using thermal sensors to activate the fan only when you need it. The CircuitShield suite of industrial-grade protections ensures that the power delivered to your system is safe and reliable in any environment. Signature Series are a great choice for a reliable and efficient PC system for gamers and professionals. The Antec Signature PLATINUM 1300 features whisper-quiet, fluid dynamic bearing 135mm fan that provides high airflow with durability and longevity. It also has a server-class full-bridge LLC design with a synchronous rectification based on a DC-DC topology. It allows 2 Signature PSUs to work in tandem to power the most demanding systems. It is a fully modular PSU. It enables users to use only the cables which are needed and help clear out excess cables that can obstruct and reduce airflow. The Antec Signature PLATINUM 1300 comes with 10 years of warranty.",
      "price": "27000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ANTEC",
        "model": "SP1300 Platinum",
        "Certification": "80 Plus Platinum",
        "frequencyRange": "47Hz ~ 63Hz",
        "modularType": "Fully",
        "voltage": "1300W"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/corsair/hx1500i-1500w/hx1500i-1500w-01-500x500.webp",
      "productName": "Corsair HX1500i 1500W 80+ Platinum Full-Modular ATX Power Supply",
      "category": "Power-supply",
      "description": "The Corsair HXi Series Fully Modular Power Supply is Ultra-Low Noise with three EPS12V connections and employs the finest quality components to produce 80 PLUS Platinum efficient power. With three EPS12V ports and completely modular wiring, HXi Series platinum power supplies provide every connection needed to support today's most demanding PC upgrades now and in the future, including the newest generation of power-hungry graphics cards and CPUs. The HXi Series PSUs have a 140mm fluid dynamic bearing fan with Zero RPM mode support for long-lasting fan performance and near-silent operation when the fan shuts off at low and medium loads, only spinning as fast as needed. HXi PSUs are 80 PLUS Platinum certified and use quality 100% Japanese 105°C electrolytic capacitors for outstanding power delivery and long-term dependability with low power consumption, reduced noise, and lower temperatures. CORSAIR iCUE software integrates your whole setup, resulting in a fully immersive ecology with straightforward control. The Corsair HX1500i 1500W 80+ Platinum Full-Modular ATX Power Supply comes with a 10-year warranty.",
      "price": "45000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "HX1500i 1500W",
        "Certification": "80 PLUS Efficiency Platinum",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "Fully Modular",
        "voltage": "100 - 240V"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/asus/thor-1200p2/thor-1200p2-500x500.webp",
      "productName": "ASUS ROG THOR 1200P2 GAMING 80 Plus Platinum 1200W Power Supply",
      "category": "Power-supply",
      "description": "The inbuilt OLED monitor in the ROG Thor 1200P Platinum Power Supply Unit provides a real-time display of power consumption. Now you can easily check how much electricity your apparatus is using. To improve component lifespan, the ROG Thor 1200W Platinum has a 135mm unique Wing-blade fan. The fan is kept spinning freely thanks to IP5X dust protection, and 0dB technology makes use of thermal sensors to enable the fan to entirely shut off at lower wattages for absolutely silent operation. The integrated ROG heatsinks are 20% cooler inside the ROG Thor 1200W Platinum thanks to their 2x larger capacity than conventional designs. As a result, components last longer and can operate at 0dB for longer than in conventional designs. Given how efficient the heatsinks are, the fan",
      "price": "50000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "THOR 1200P2",
        "Certification": "Lambda A++ Certification",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "Fully modular",
        "voltage": "100 - 240V"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    }
  ],
  "storage": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/samsung/980-1tb/980-1tb-500x500.jpg",
      "productName": "Samsung 980 1TB PCIe 3.0 M.2 NVMe SSD",
      "category": "Storage",
      "description": "The Samsung 980 1TB PCIe 3.0 M.2 NVMe SSD is a super fast processing storage unit that is 3 times faster then conventional hard disk drives. The Samsung 980 1TB SSD is designed with PCIe Gen 3.0 x4, NVMe 1.4 interface that enables it to work faster and efficiently then other M.2 SSDs. The SSD is designed with 1,500 G & 0.5 ms (Half sine) which is able to protect the internal structure of the SSD and save all the data that have been stored inside. The Samsung 980 1TB SSD is designed and programmed with TRIM AND SMART support.",
      "price": "7690",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "SAMSUNG",
        "model": "980 1TB",
        "formFactory": "M.2 (2280)",
        "mtbf": "1.5 Million Hours",
        "dimension": "3.15' X 0.94' X 0.87'",
        "weight": "1.92 oz"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/zadak/twss3/twss3-500x500.jpg",
      "productName": "ZADAK TWSS3 1TB SATA3 2.5' SSD",
      "category": "Storage",
      "description": "The ZADAK TWSS3 1TB SATA3 2.5' SSD is a high-speed SSD that comes with the SATA III 6Gbps interface. It can reach the sequential read and write speed of up to 560/540 MB/s. 3D NAND technology not only for higher capacities but also to help reduce cell-to-cell interference for enhanced reliability. It effectively eliminates Power Consumption Optimized Durability and Performance at High Stability, High Capacity with Enhanced Reliability making It a primal Choice for PC Upgrade. It operates with low power, 95% less than conventional computer hard drives. It comes with Optimized Durability and Performance at High Stability. Advanced Wear Leveling, ECC and supports TRIM command to extend the lifespan with stability and maintain the performance highly efficient even after long-term usage. It can withstand critical vibration criteria at 15G, and shock at 1500G. Thereâ€™s no need to worry about hard drive failure and data corruption even on the go. The ZADAK TWSS3 offers 5-Year Limited Warranty.",
      "price": "9700",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "ZADAK",
        "model": "TWSS3",
        "formFactory": "2.5'",
        "mtbf": "1,500,000 hours",
        "dimension": "100mm x 69.9mm x 7mm",
        "weight": "1.92 oz"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/seagate/barracuda-q5-1tb/barracuda-q5-1tb-01-500x500.jpg",
      "productName": "Seagate BarraCuda Q5 1TB NVMe M.2 Internal SSD",
      "category": "Storage",
      "description": "The Seagate BarraCuda Q5 1TB NVMe M.2 SSD provides up to 50x quicker performance than traditional hard drives. With its 3D QLC NAND technology and M.2 2280 form size, this SSD provides up to 50x quicker performance than standard hard drives. It employs the PCIe 3.0 x4 / NVMe 1.3 interface, which ensures consistent and efficient data transfer rates. The Seagate BarraCuda Q5 SSD features exceptional sequential read and writes speeds of up to 2400 MB/s, making it suitable for demanding applications like gaming, video editing, and content production. It also has a mean time between failures (MTBF) of 1.8 million hours, which ensures long-term performance and dependability. This SSD has a total bytes written (TBW) capacity of 274TB, indicating that it can handle large quantities of data. It has SMART and TRIM support to assure the SSD's health and performance, which helps to maximize the drive's performance and avoid data loss. As an added benefit, Seagate gives the free SeaTools SSD software program to monitor the drive's performance, health, and firmware upgrades. This Seagate BarraCuda Q5 1TB NVMe M.2 Internal SSD is a superb storage option with remarkable speed, reliability, and durability, making it a perfect choice for individuals who expect the finest performance from their computer equipment.",
      "price": "2000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "BARACUDA",
        "model": "BarraCuda Q5",
        "formFactory": "M.2 2280",
        "mtbf": "1.8 Million Hours",
        "dimension": "0.9 x 0.08 x 3.1' / 22 x 2.15 x 80 mm",
        "weight": "0.02 lb / 9 g"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/samsung/870-qvo/870-qvo-1-500x500.jpg",
      "productName": "Samsung 870 QVO 4TB 2.5' SATA III SSD",
      "category": "Storage",
      "description": "Samsung 870 QVO 4TB 2.5' SATA III SSD The Samsung 870 QVO comes with a 4TB Capacity. This SSD features an expanded SATA interface limit of 560/530 MB/s sequential speeds, the 870 QVO improves random access speed and sustained performance. Intelligent TurboWrite accelerates write speeds and maintains long-term high performance with a larger variable buffer. The Samsung 870 QVO 4TB SSD increases reliability up to 360 TBW (terabytes written) using a refined ECC (error-correcting code) algorithm for stable performance. Its upgrading to 870 QVO is now easier than ever for anyone with a desktop PC or laptop that supports a standard 2.5-inch SATA form factor. Simply plug in the 870 QVO into a SATA slot and let the updated migration software take care of the rest. This SSD comes with SATA 6 Gbps Interface, compatible with SATA 3 Gbps & 1.5 Gbps interfaces. It supports Trim, S.M.A.R.T., GC (Garbage Collection), WWN Support, etc. This SSD is compatible with Windows10/ Windows 8/ Windows 7/ Windows Server 2003 (32 bit and 64 bit), Vista (SP1 and above), XP (SP2 and above), MAC OSX, and Linux operating system. The new Samsung 870 QVO SSD has 03 years of warranty.",
      "price": "31999",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "SAMSUNG",
        "model": "870 QVO",
        "formFactory": "2.5 inch, Capacity: 4TB",
        "mtbf": "1.5 Million Hours",
        "dimension": "3.94' X 2.76' X 0.27'",
        "weight": "0.19 lbs."
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/seagate/ironwolf-125-500gb/ironwolf-125-500gb-01-500x500.webp",
      "productName": "Seagate IronWolf 125 2TB 2.5-inch SATA III SSD",
      "category": "Storage",
      "description": "The Seagate IronWolf 125 2TB 2.5-inch SATA III SSD is designed for demanding workloads and multi-user NAS settings, and it provides powerhouse performance with 24/7, always-on capabilities. This 2TB SSD is compatible with Windows 10, 8.1, and Unix and features a SATA III 6 Gb/s interface, a 2.5' / 7mm form factor, sustained sequential read rates of up to 560 MB/s, and sustained sequential write speeds of up to 540 MB/s. It's IronWolf 125 SSD also boasts an MTBF rating of 1.8 million hours, 1 in 1017 non-recoverable read errors per bit read, a Total Bytes Written (TBW) capacity of up to 700TB, and 3D TLC NAND flash memory.",
      "price": "47500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IRONWOLF",
        "model": "IronWolf 125",
        "formFactory": "2.5 inch",
        "mtbf": "1.8 Million Hours",
        "dimension": "3.94 x 2.76 x 0.28' / 10 x 7 x 0.7 cm",
        "weight": "50g"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    }
  ],
  "monitor": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/uniview/mw3224-v/mw3224-v-500x500.webp",
      "productName": "Uniview MW3224-V 24' LED FHD Monitor With Built-In Speakers",
      "category": "Monitor",
      "description": "The Uniview MW3224-V 24' LED FHD Monitor has a 23.8-inch LED-backlit display with a 1920x1080 resolution and a 16:9 aspect ratio, which provides sharp and clear images with vibrant colors and broad viewing angles. The display also offers a quick 14ms reaction time and a refresh rate of 60Hz, assuring smooth and responsive performance while gaming, streaming video, and multitasking. The monitor has a VGA and an HDMI connector, so it may be connected to a variety of devices such as laptops, desktops, consoles, and media players. The Uniview MW3224-V 24' LED FHD Monitor also includes an in-built speaker system with a 3.5mm audio connection, providing rich and clear sound for your pleasure. The monitor has a clean and attractive design with a narrow bezel and a solid base that supports VESA installation. The display also offers an OSD menu in two languages (English and Simplified Chinese) for quick configuration adjustments. The Uniview MW3224-V 24' LED FHD Monitor consumes less than 24W when turned on and less than 0.5W when turned off, making it energy-efficient and environmentally friendly. The kit includes an HDMI cable, a power cable, an adapter, a pedestal, and a fast guide. The net weight of the monitor is 3.3kg (7.28lb), while the gross weight is 4.6kg (10.14lb). The dimensions of the display are 541.8mm x 412.6mm x 200mm (21.33' x 16.24' x 7.87').",
      "price": "12800",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "UNIVIEW",
        "model": "MW3224-V",
        "port": "1x VGA, 1x HDMI, 1x 3.5 mm",
        "display": "TIPO, 60Hz, 14ms",
        "features": "2x 1.5W Built-In Speakers",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/va249he/va249he-500x500.jpg",
      "productName": "Asus VA249HE 23.8 inch Full HD Eye Care Monitor",
      "category": "Monitor",
      "description": "Asus VA249HE 23.8 inch Full HD Eye Care Monitor.Flicker Free, Blue Light Filter, Anti Glare.It has 3,000:1 ultra high contrast and ASCR 100,000,000:1, 5ms(GTG)response time ensure better image quality. HDMI port for mutimedia and entertainment enjoyment.",
      "price": "20499",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "VA249HE",
        "port": "HDMI, VGA",
        "display": "VA, 60Hz, 5ms",
        "features": "Flicker Free, Low Blue Light",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/fantech/gm271sf/gm271sf-1-500x500.jpg",
      "productName": "Fantech GM271SF Chimera 27' 165Hz IPS FHD Gaming Monitor",
      "category": "Monitor",
      "description": "Fantech GM271SF Chimera 27' 165Hz Gaming Monitor is perfect for full-display gaming setups and content creation, with a 3-side borderless display that maximizes your viewing experience while minimizing frame distractions. It is equipped with a 1920x1080 resolution. The 165Hz Refresh Rate monitor combined with a 1ms response rate offers smoother, clearer action while reducing blur and ghosting. It has been designed for incredible speed. CHIMERA Fast IPS Display allows up to 4X faster than conventional IPS panels for improved response. With a 1ms response time, smearing and motion blur are virtually eliminated. It comes with the latest adaptive sync technology and it supports Freesync. Enjoy tear-free, shutter-free, fluid gaming. The monitor has been designed with a breathing lighting effect to enhance your gaming experience. It comes with a tilt base so you can tilt the display for the most comfortable viewing angle. The Fantech GM271SF Chimera 27' 165Hz Gaming Monitor comes with 1 year warranty",
      "price": "35000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "GM271SF Chimera",
        "port": "HDMI, DP, 3.5mm Audio Out",
        "display": "IPS, 165Hz, 1ms",
        "features": "Free Sync",
        "aspectRation": "1920 x 1080"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/vg259qm/vg259qm-500x500.jpg",
      "productName": "ASUS TUF Gaming VG259QM 24.5inch FHD 280Hz G-SYNC Overclockable Monitor",
      "category": "Monitor",
      "description": "Astonishing overclockable 280Hz refresh rate means the display is almost twice as fast as conventional 144 Hz monitors. You'll experience amazingly fluid gaming visuals, giving you the upper hand in first-person shooters, racing, real-time strategy, and sports titles. Fast IPS Display allows the display's liquid crystal elements to switch up to 4X faster than conventional IPS panels for improved response. With a 1 ms gray-to-gray response time, smearing and motion blur are virtually eliminated. This display also delivers superior images with outstanding colors thanks to 72% NTSC color gamut and an astounding 1,000:1 contrast ratio. Wide 178-degree viewing angles ensure minimal distortion and color shift even when you're viewing from extreme positions. With variable-refresh-rate (VRR) technology enabled by default, you're assured seamless, tear-free gaming experiences from your NVIDIA GeForce GTX 10 or NVIDIA GeForce RTX 20-series graphics card. HDR technology delivers a wider color range and higher contrast than traditional monitors. The brightest whites and the darkest blacks bring out details like never before. The display is also capable of 400 cd/m2, meeting the stringent requirements for DisplayHDR 400 certification. ASUS Dynamic Shadow Boost technology automatically clarifies dark areas of the game world with optimizing other areas, improving overall viewing while also making it easier to spot enemies hidden in shaded areas of the map. The ASUS-exclusive, integrated GamePlus hotkey offers in-game enhancements that help you get more out of your game. This function is co-developed with input from pro gamers, allowing them to practice and improve their gaming skills. ASUS GameVisual Technology has seven pre-set display modes to optimize visuals for different types of content. This unique feature can be easily accessed through a hotkey or the on-screen display settings menu. Flicker-Free technology reduces flicker to minimize eyestrain for improved comfort when you're embroiled in long gaming sessions. ASUS Ultra-Low Blue Light technology reduces the amount of potentially harmful blue light emitted by the display. Four different filter settings are available to control the amount of blue light reduction. Extensive connectivity options, including DisplayPort1.2, HDMI 2.0x2, and Earphone Jack offer support for wide array of multimedia devices. With an ergonomically-designed stand, it provides tilt, swivel, pivot, and height adjustments so you can easily find your ideal viewing position. The display is also VESA-compatible for wall mounting.",
      "price": "52000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "ASUS TUF VG259QM OC",
        "port": "HDMI, DP, 3.5mm Audio Out",
        "display": "IPS, 280Hz, 1ms",
        "features": " Free Sync, Flicker Free, Low Blue Light, G-Sync",
        "aspectRation": "1920x1080"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/vp32uq/vp32uq-01-500x500.jpg",
      "productName": "Asus VP32UQ 31.5 inch 4K UHD IPS Monitor",
      "category": "Monitor",
      "description": "Asus VP32UQ Monitor comes with 31.5-inch, 4K UHD (3840 x 2160) resolution display with IPS 178Â° wide viewing angle for sharp and immersive visuals. It delivers sharp, detail and immersive viewing experience. 100% sRGB provides realistic colors and smoother gradation, to achieves seamlessly smooth gameplay. And you will get to enjoy sharp, detailed visuals. On top of that, more onscreen space for multitasking so you get more things done quickly.This monitor support HDR-10 to enhance bright and dark area. The Asus VP32UQ Monitor has DisplayPort, HDMI, built-in 2W x 2 stereo speakers. Here, the Adaptive-Sync technology to animated content with fast action and eliminate screen tearing. The ASUS Eye Care monitors feature TÃœV Rheinland-certified Flicker-free and Low Blue Light technologies to ensure a comfortable viewing experience. This monitor also supports both Adaptive-Sync with NVIDIA GeForce graphics cards and FreeSync with AMD Radeon graphics cards and also compatible with NVIDIA GeForce GTX 10 series, GTX 16 series, RTX 20 series and newer graphics cards. In this monitor, the Exclusive ASUS blue light filter protects you from harmful blue light, and It's easy to access, intuitive and flexible with seamless adjustment. The latest Asus VP32UQ 31.5 inch 4K UHD IPS Monitor has 03 years of warranty.",
      "price": "65000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "VP32UQ",
        "port": "1x HDMI, 1x DP",
        "display": "IPS, 60Hz, 4ms(GTG)",
        "features": "Free Sync, Eye Care, Flicker Free,100% RGB",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    }
  ],
  "casing": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/corsair/470t-rgb/470t-rgb-500x500.jpg",
      "productName": "Corsair 470T RGB Mid-Tower Gaming Casing",
      "category": "Casing",
      "description": "The CORSAIR 470T RGB is a distinctive mid-tower ATX case with a spacious interior, striking RGB style, and great cooling. Combining a spacious interior, striking RGB style, and proven CORSAIR build quality, the 470T RGB is a great choice for your new high-performance PC. Offers sharp looks accented by an integrated RGB light strip, with mesh backing for strong intake airflow. Fits up to 7x 120mm or 4x 140mm cooling fans, along with multiple radiators including a 360mm in front or in the roof. Puts your connections within easy reach, including 2x USB 3.0 ports, a microphone jack, an audio jack, and push-button control of your front panel RGB lighting. Show off your high-profile components and RGB lighting.",
      "price": "3499",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "Corsair 470T RGB",
        "dimensions": "495 x 477 x 213 mm",
        "type": "Mid-Tower Gaming Casing"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/antec/dp505-white/dp505-white-01-500x500.webp",
      "productName": "Antec DP505 White Mid-Tower E-ATX Gaming Case",
      "category": "Casing",
      "description": "The Antec DP505 White Mid-Tower E-ATX Gaming Case supports E-ATX, ATX, Micro-ATX, and ITX motherboards. It features an extensive interior and powerful compatibility. 2 x 360mm can be installed in the front & on the top simultaneously. This desktop PC gaming casing comes with a massive X-shaped mesh front panel and ventilation on the top, at the bottom, and in the PSU chamber, which will accelerate the airflow circulation and enhance the cooling performance. The Antec DP505 White comes with a Massive Mesh Front Panel with X-Shaped Design. There is a magnetic dust filter on the top and a pull-out dust filter at the bottom. It offers well-designed cable routing making wiring easy and simple, with a spacious 23mm of space for cables. It can fit up to 4 drives easily.",
      "price": "8900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "ANTEC",
        "model": "DP505 White",
        "dimensions": "481 x 220 x 490mm (DWH)",
        "type": "Mid Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/xigmatek/overtake/overtake-01-500x500.webp",
      "productName": "XIGMATEK Overtake Tempered Glass Rainbow RGB Super Tower EATX Gaming Case",
      "category": "Casing",
      "description": "XIGMATEK Overtake Super Tower EATX Gaming Case is a new generation Rainbow RGB PC case with front, left, and right tempered glass. This case chassis is designed for all major E-ATX, ATX, M-ATX gaming, or professional motherboard. It supports 180mm CPU Cooler clearance and 380mm VGA card. The XIGMATEK Overtake can support up to 11 x 120mm fan or liquid cooling radiators Front 480/360mm, MB side 280/240, and Rear 240/280mm for excellent cooling performance. The two-sided tempered glass design allows more air intake through front panel side vents. Three-sided tempered glass for best showing professional or gaming system build. The special chassis design of XIGMATEK Overtake is easy to do cable management and hides all the messy cables for a tidy display. Overtake especially comes with see-through tempered glass; it is a perfect choice to display how beautiful your system build will be. It supports up to 4x2.5' SSD Or 2x3.5' HDD+2 X 2.5' SSD W/O extend HDD Bay. The XIGMATEK Overtake comes with no warranty.",
      "price": "12400",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "XIGMATEK",
        "model": "Overtake",
        "dimensions": "485 x 247 x 566mm",
        "type": "Mid-Tower Gaming Casing"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/lian-li/o11-dynamic-mini/o11-dynamic-min-black-with-psu-500x500.jpg",
      "productName": "Lian Li O11D Mini-X O11 Dynamic MINI Black Mini-tower Gaming Case",
      "category": "Casing",
      "description": "The Lian Li O11D Mini-X O11 Dynamic MINI is a case that would accommodate the maximum number of water-cooling configurations without being oversized. The Lian Li O11D Mini-X O11 Dynamic MINI supports mini-ITX, micro-ATX, ATX, and E-ATX motherboard sizes. It comes with a modular back panel design, the user has the option to choose from 3 slots/ 5 slots/ 7 slots I/O shield to optimize the case to the configuration of the user’s choice. It supports up to 9 fans to cool the chassis. It comes with a blend of brushed aluminum and tempered glass. This casing has a high-quality feel and touches on the exterior.",
      "price": "24500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Lian",
        "model": "O11 Dynamic MINI",
        "dimensions": "(D)420mm X (W)269.5mm X (H)380mm",
        "type": "Mini-Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/thermaltake/level-20/level-20-01-500x500.webp",
      "productName": "Thermaltake Level 20 Tempered Glass Edition Full-Tower RGB Gaming Case",
      "category": "Casing",
      "description": "The Thermaltake Level 20 Tempered Glass Edition Full-Tower Gaming Case features an E-ATX full tower chassis with three tempered glass panes and three 140mm Riing Plus 14 RGB fans that come pre-installed. The Thermaltake Gaming Case features a ventilation-focused, trio-chamber design with tempered glass and a tool-less locking mechanism, quick transmission (USB Type-C and USB 3.0), TT Premium Gaming PCI-E 3.0 Riser Cable, and integration with cutting-edge' TT RGB PLUS software/voice-controlled with as well as three built-in Riing Plus 14 LED RGB Fans, two Lumi Plus LED Strips front and rear, and one Riing Plus Digital Controller. The Three Riing Plus 14 RGB Fans and two Lumi Plus LED Strips are incorporated in to improve airflow while lighting up Level 20 with 16.8 million distinctly beautiful illumination display colors. The Thermaltake tempered glass Full-Tower casing exclusive accreditation is only awarded to goods that meet the design and hardcore enthusiast standards that should be applied to a true LCS chassis. The Tt LCS certification was designed so that Thermaltake Full-Tower casing could identify which chassis have been tested to be best compatible with extreme liquid cooling systems, ensuring you get the highest performance from the best features and fitting. It has TT Premium is much more than a quality guarantee. Behind the name is a love of DIY and modding, as well as Thermaltake's case aim to be the most inventive company in the PC hardware market. The Thermaltake Level 20 case has TT RGB PLUS Ecosystem intelligent lighting solution for PCs that combines the most modern addressable LED lighting with Thermaltake's own TT RGB PLUS Software. The Thermaltake tempered glass Full-Tower Casing has aluminum panels developed by high-precision CNC digital cutting to assure chassis security while delivering a futuristic gaming spirit. To meet users' expectations, the bundled Thermaltake casing has TT Gaming PCI-E 3.0 Riser Cable features premium quality, ultra-high speed cable, and EMI shielding with a conductive polymer. The Thermaltake Casing Level 20 includes a USB Type-CTMI/O port with a 10G communication speed per port. There are also USB 3.0 I/O ports. The Thermaltake Level 20 Tempered Glass Edition Full-Tower RGB Gaming Case has no Warranty.",
      "price": "86500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "THERMALTAKE",
        "model": "Level 20",
        "dimensions": "732 x 280 x 688 mm",
        "type": "E-ATX Full Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    }
  ],
  "mouse": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/fantech/g13-rhasta-ii-pro/g13-rhasta-ii-pro-001-500x500.jpg",
      "productName": "Fantech G13 Rhasta II Pro Gaming Mouse Black",
      "category": "Mouse",
      "description": "Fantech G13 Rhasta II Pro Gaming Mouse comes with Additional functions Game optical sensor. This gaming mouse has a maximum resolution of 2400 DPI, a Dedicated button for changing modes DPI â€œon the fly with 3 buttons + 1 scroll wheel/button. It's a scroll wheel built in Silicone & rubber materials. This gaming mouse is featured with 5 million keystrokes cycle buttons durability, 4 buttons, Cable in tissue braid, RGB lights, Low friction legs, and also suitable for right and left-handed users. This new Fantech Gaming mouse is compatible with Microsoft Windows, Mac OS, Linux, Chrome operating system. The Fantech G13 Rhasta II Pro Gaming Mouse has a 01-year warranty.",
      "price": "475",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "Fantech G13 Rhasta II Pro",
        "type": "USB Wired",
        "buttons": "3 buttons + 1 scroll wheel / button"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/imice/v6-gaming/v6-gaming-01-500x500.jpg",
      "productName": "IMICE V6 Professional Wired Gaming Mouse",
      "category": "Mouse",
      "description": "The IMICE V6 Professional Wired Gaming Mouse has 7 buttons, a 3200 DPI, multimedia capabilities, and LED lighting. Black-Grey. An outstanding mouse that was properly built for the demands of every gamer, but also high-requirement office work, comes with ergonomic design and great aesthetics, while its performance satisfies the needs of any user. With great accuracy and illumination of various combinations determined by the user, LED Breathing Light technology is used in conjunction with the appropriate software. The resolution is adjustable to four levels, each of which may be tailored to the user's specific needs. Additionally, with the use of software, each of the buttons may be assigned a distinct function according to any requirements. The design allows right-handed and left-handed users to have the same user experience, and there is a unique liner at the base of the mouse for smoother gliding on the surface. With a plug-and-play connection, it is compatible with any operating system. The IMICE V6 Professional Wired Gaming Mouse has 1200/1600/2400/3200 DPI resolution, 6 keys Frame rate 4000 frames per second, maximum speed 30 inches, per second Voltage 5V 100 mA and Rate-Frequency 125 Hz/s. This mouse comes with a 01-year warranty.",
      "price": "605",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IMICE",
        "model": "V6",
        "type": "Wired Gaming Mouse",
        "buttons": "6 buttons"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/fantech/vx7-crypto/vx7-crypto-sakura-edition-01-500x500.jpg",
      "productName": "Fantech VX7 Crypto Sakura Edition 6 Button USB Gaming Mouse",
      "category": "Mouse",
      "description": "The Fantech VX7 Crypto Sakura Edition is an ideal gaming mouse. The main feature of this model is its nice design and On-the-fly Adjustable Dpi(800-1200-1600-2400). Thanks to an innovative sensor equipped with a DPI mode switch, the mouse sensitivity range reaches about 2400 DPI. But sliding the mouse on the playing surface is almost perfect. The main change in this mouse is comprised of 6 buttons. The keys of this mouse have a 3 Million click lifetime. The Fantech VX7 Crypto Sakura Edition comes with a 1-year warranty.",
      "price": "1050",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "VX7 Crypto Sakura Edition",
        "type": "wired",
        "buttons": "6"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/logitech/g102-lightsync/g102-lightsync-01-500x500.webp",
      "productName": "Logitech G102 Lightsync RGB USB Gaming Mouse",
      "category": "Mouse",
      "description": "Logitech G102 Lightsync Mouse reports 1,000 times per second, 8x faster than standard mice. This means when the mouse is moved or clicked the onscreen response is virtually instantaneous. Play to your full potential with a mouse that offers 200 to 8,000 DPI delivering incredible accuracy, tracking speed, and consistency. LIGHTSYNC technology provides next-gen RGB lighting that synchronizes lighting and game profiles with your content. Customize from a full spectrum of approximately 16.8 million colors and synchronize lighting animations and effects with your other Logitech G devices. Customize it all quickly and easily using Logitech Gaming Software (LGS).On-the-fly DPI shifting between two sensitivity settings with a click, from pixel-precise 250 DPI targeting to speedy 2,500 DPI movement. Use LGS to customize the DPI settings to fit your style of play. Also, DPI cycling lets you choose from up to five DPI settings while in-game.System requirements are Windows 7 or later, macOS 10.11 or later, chrome OSTM, USB port, and internet access for Logitech Gaming Software (optional). Responsiveness data formats are 16 bits/axis, USB report rate: 1000 Hz (1ms), microprocessor 32-bit ARM.",
      "price": "1950",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G102 Lightsync",
        "type": "Wired",
        "buttons": "6 programmable buttons"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medimu budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/logitech/g502-hero/g502-hero-1-500x500.jpg",
      "productName": "Logitech G502 HERO High Performance RGB Gaming Mouse",
      "category": "Mouse",
      "description": "Logitech G502 HERO High Performance RGB Gaming Mouse is built in an advanced optical sensor for customizable RGB lighting, maximum tracking accuracy, custom game profiles with from 200 up to 16,000 DPI resolution.This gaming mouse provides High-performance HERO 16K Sensor which is more accurate in gaming speed. HERO 16K sensor is capable of 400+ IPS with zero smoothing, filtering or acceleration with achieves competition-level precision and the most consistent responsiveness ever. This exclusive mouse has 11 fully programmable buttons with Five 3.6G adjustable weight and save up to five ready-to-play profiles directly to the mouse. It is configurable in a variety of front, rear, left, right and center weighted configurations. In this G502 HERO mouse, there are 16.8 million colors and synchronize lighting animations which is effects with your other Logitech G devices. By using next generation RGB (LIGHTSYNC technology), it will deliver the most immersive RGB experience ever which is driven by games, audio, or your screen. This unique mouse has 50 million clicks of main buttons, > 250 kilometers PTFE Feet, > 40 G max. acceleration, > 400 IPS max. speed. Its responsive features are 16 bits/axis USB data format, 1000 Hz (1ms) USB report rate, 32-bit ARM Microprocessor. The HERO RGB Gaming Mouse is compatible with Windows 7 or later, macOS 10.11 or later, Chrome OS, USB port and (Optional) Internet access for Logitech G HUB (G HUB). Experiment with the alignment and balance to find the sweet spot to optimize your gaming performance. This exclusive gaming mouse has 02 years of warranty.",
      "price": "4700",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G502 HERO",
        "type": "Wired USB",
        "buttons": "50 million click"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    }
  ],
  "keyboard": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/imice/gk-700/gk-700-01-500x500.jpg",
      "productName": "IMICE GK-700 USB RGB Gaming Keyboard",
      "category": "Keyboard",
      "description": "The IMICE GK-700 Gaming Keyboard is meant to be waterproof. The carter key seat diversion hole design efficiently prevents fluids from splashing into the body while being safe and dependable. The keyboard's metal plate is intended to store small things such as mobile phones and pencils. The IMICE GK-700 USB RGB Gaming Keyboard casing is composed of frosted aluminum to prevent the violent gaming operation from slipping. This keyboard has a multicolored changeable backlight and laser engraved keycaps, allowing the characters to see even in the dark. This ergonomic arc key design has adjustable foot support and a smooth operation. The IMICE GK-700 Gaming Keyboard comes with a 01-year warranty.",
      "price": "1200",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IMICE",
        "model": "GK-700",
        "type": "RGB Gaming",
        "color": "Black",
        "dimension": "470x180x38mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/dareu/a87-alpha/a87-alpha-01-500x500.jpg",
      "productName": "Dareu A87 Alpha Tenkeyless Red Cherry MX Switch Mechanical Keyboard",
      "category": "Keyboard",
      "description": "Dareu A87 Alpha Tenkeyless Mechanical Keyboard equipped with Cherry MX Mechanical Switch that can hold up until 50 Million Clicks. This Tenkeyless Mechanical Keyboard is featured with Switch: Red Cherry MX Mechanical Switch, Key Fields: 3 Blocks, Cherry MX Mechanical Switch, Detachable Top Cover, PBT Material Keycaps & N-Key Rollover, USB Type-C Interfaced, Adjustable Effect Ice Blue Light. Here, the top cover can be detachable. It is convenient to disassemble cleaning and replacement. In this keyboard, Wear resistance character and it will not cause greasy hand feeling, and also support N-Key Rollover to avoid ghosting. It is compatible with Windows XP/Win 7/Win 8/Win 10 operating system. This latest Dareu A87 Alpha Tenkeyless Mechanical Keyboard has 1 Year Official Warranty.",
      "price": "5800",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "DAREU",
        "model": "A87 Alpha",
        "type": "Mechanical",
        "color": "Black",
        "dimension": "359 x 136 x 36mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/logitech/g-613/g-613-black-1-500x500.jpg",
      "productName": "Logitech G613 Wireless Mechanical Gaming Keyboard",
      "category": "Keyboard",
      "description": "G613 is a next generation wireless keyboard designed for gamers who demand both the high performance capabilities of mechanical switches and the freedom of wireless gaming. Through end-to-end engineering and design, Logitech G developed a robust wireless solution to solve the fundamental problems of latency, stability, and connectivity. The end result is LIGHTSPEED, a pro-grade wireless solution, that achieves wired-like performance. Romer-G Tactile switches deliver quiet, precise mechanical performance with incredible feel and durability with 70M click-life. The choice of top esports professionals, Romer-G Tactile switches have a short-throw actuation at 1.5 mm which means 25% faster 11.5 mm vs 2.0 mm actuation distance on standard mechanical switches. keystrokes than the competitionâ€™s standard mechanical switches. Romer-G is a perfect blend of speed, precision and quiet performance while still maintaining a discernible, tactile actuation feel. Six dedicated G-keys can be programmed with custom macros and in-app commands. Execute complex actions, simply and quickly, with a keystroke. G-keys can be assigned per game or app profile for customizability and convenience. Use Logitech G HUB to easily setup and manage profiles, commands and more. Connect to LIGHTSPEED wireless for super fast 1 ms report rate or swap to another device with the push of a button using Bluetooth connectivity. Toggle between high-performance LIGHTSPEED wireless via USB receiver and Bluetoothâ€” quickly and easily. Using only 2 AA batteries, G613 can be used for up to 18 months. Battery life may vary based on your usage and computing conditions.. When battery is at 15%, both the LED status indicator light on the keyboard and Logitech G HUB notifications will warn you before the critical moment hits. Pair G613 wireless mechanical keyboard with G603 wireless gaming mouse to acquire the complete wireless desktop solution. G603 features our next generation HERO sensor, LIGHTSPEED wireless, Hi-Lo power management system and more high performance features that gaming enthusiasts demand.",
      "price": "8900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G613",
        "type": "Bluetooth",
        "color": "Gray",
        "dimension": "Height: 478 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/razer/huntsman-mini/huntsman-mini-1-500x500.jpg",
      "productName": "Razer Huntsman Mini 60% Optical Gaming Keyboard Purple Switch",
      "category": "Keyboard",
      "description": "The Razer Huntsman Mini is a 60% gaming keyboard with cutting-edge Purple Razer Optical Switches, which is highly portable and ideal for streamlined setups, itâ€™s time to experience lightning-fast actuation in our most compact form factor yet. It is the go-to choice for gamers who prefer receiving crisp, tactile feedback that sounds as satisfying as it feels.This gaming Keyboard offers faster, lighter, and smoother actuation than mechanical switches, and lasts longer as it requires fewer moving parts that operate with less friction. This gaming keyboard is designed for greater durability, the keycaps on this 60% gaming keyboard have a premium, textured quality thatâ€™ll never degrade to a shiny finish or have their labeling wear off with intense use. For easier reference when executing commands and hotkeys, side-printed secondary functions have also been added. This exclusive gaming keyboard comes with 01 year warranty (Need to submit product box for warranty claim).",
      "price": "14000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "RAZER",
        "model": "Razer Huntsman Mini",
        "type": "60% Gaming Keyboard with Razer Optical Switch",
        "color": "Black and Mercury",
        "dimension": "462 X 155 X 39 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/asus/rog-claymore-ii/rog-claymore-ii-01-500x500.jpg",
      "productName": "Asus ROG CLAYMORE II Modular TKL Mechanical Blue Switch Gaming Keyboard",
      "category": "Keyboard",
      "description": "The Asus ROG CLAYMORE II is a gaming mechanical keyboard with ROG RX Optical Mechanical Switches, detachable Numpad & wrist rest, wired & wireless 2.4G modes, extra customizable clicky hotkeys, volume control wheel, and wireless Aura Sync. The ROG CLAYMORE II delivers a host of features designed to give you exciting new ways to play. Create your ideal gaming setup by placing the new detachable Numpad on whichever side you prefer; then choose between wired or wireless mode and light it all up with Aura Sync. The detachable Numpad can be attached on either side of the keyboard, or it can be removed entirely if you prefer to use ROG Claymore II in TKL mode (80%). ROG RX Blue Optical Mechanical Switches offer consistent, wobble-free keystrokes with a superfast 1 ms response and 100-million-keystroke lifespan. ROG PBT Doubleshot Keycaps provide a unique and premium feel, as well as offer long-lasting durability. A 4000 mAh battery and energy-efficient design give you up to 43 hours of nonstop gaming in wireless mode on a single charge, even with RGB lighting on. 30 minutes of USB-C fast charging allows ROG Claymore II to be operated for up to 18 hours (lighting off). The detachable Numpad includes four media control keys that can be programmed into hotkeys for convenient productivity shortcuts or macro in-game commands. Thereâ€™s even a built-in control wheel for quick volume adjustment. With wireless Aura Sync RGB, the entire color spectrum and a range of dynamic lighting effects are at your command. Individually lit keys allow you to create a keyboard thatâ€™s uniquely yours. The Asus ROG CLAYMORE II comes with a 1-year replacement warranty.",
      "price": "23500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "ROG CLAYMORE II",
        "type": "Mechanical Gaming",
        "color": "Black",
        "dimension": "462 X 155 X 39 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    }
  ],
  "gpu": [
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/zotac/geforce-rtx-3050-solo/geforce-rtx-3050-solo-01-500x500.webp",
      "productName": "ZOTAC GAMING GeForce RTX 3050 Solo 8GB GDDR6 Graphics Card",
      "category": "GPU",
      "description": "",
      "price": "29500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ZOTAC",
        "model": "GAMING GeForce RTX 3050 Solo",
        "coreClock": "Boost: 1777 MHz",
        "memoryClock": "14 Gbps",
        "busType": "128-bit",
        "dimension": "168mm x 132.2mm x 39.8mm / 6.6' x 5.2' x 1.6'"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/geforce-rtx-3070-eagle/geforce-rtx-3070-eagle-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX 3070 EAGLE 8GB GDDR6 Graphics Card",
      "category": "GPU",
      "description": "",
      "price": "75000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX 3070 EAGLE",
        "coreClock": "1725 MHz",
        "memoryClock": "14000 MHz",
        "busType": "256 bit",
        "dimension": "282 x 115 x 41 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/msi/geforce-rtx-4070-ti-gaming-x-trio-white-12g/geforce-rtx-4070-ti-gaming-x-trio-white-12g-01-500x500.webp",
      "productName": "MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12GB GDDR6X Graphics Card",
      "category": "GPU",
      "description": "The MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G Graphics Card brings an enormous leap in performance, efficiency, and AI-powered graphics. It lets you experience ultra-high-performance gaming, incredibly detailed virtual worlds with ray tracing, unprecedented productivity, and new ways to create. It’s powered by the NVIDIA Ada Lovelace architecture and comes with 12 GB of G6X memory to deliver the ultimate experience for gamers and creators. The MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G features TRI FROZR 3 Thermal Design. Fan blades linked by ring arcs and a fan cowl work together to stabilize and maintain high-pressure airflow. The heat from the GPU and memory modules is captured by a copper baseplate and then rapidly transferred to Core Pipes. The heat from the GPU and memory modules is immediately captured by a solid nickel-plated copper baseplate and then rapidly transferred to an array of heat pipes. This widening of the thermal transfer systems with highly efficient mechanisms improves overall efficiency. Fins with a V-shaped cutout are located at the airflow passthrough to improve flow efficiency. MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G comes with Dual BIOS that gives you the choice to prioritize full performance in GAMING mode or low noise in SILENT mode. It comes with a bundled support bracket that can be attached to your PC case for additional graphics card reinforcement.",
      "price": "126900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "MSI",
        "model": "GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G",
        "coreClock": "Extreme Performance: 2760 MHz (MSI Center)",
        "memoryClock": "21 Gbps",
        "busType": "192-bit",
        "dimension": "337 x 140 x 62 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphich card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/rtx-4070-ti-gaming-oc-12g/geforce-rtx-4070-ti-gaming-oc-12g-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX­­ 4070 Ti GAMING OC 12GB GDDR6X Graphics Card",
      "category": "GPU",
      "description": "The GIGABYTE GeForce RTX 4070 Ti GAMING OC is a powerful graphics card for gaming and demanding multimedia applications. It comes with a core clock speed of 2640 MHz and it features 7680 CUDA cores and 12 GB of GDDR6X memory with a clock speed of 21 Gbps and a 192-bit memory bus. The card is PCI-E 4.0 compliant and can support digital resolutions of up to 7680x4320. It also has 3 DisplayPort 1.4 outputs and 1 HDMI 2.1 output. It has 4 multi-view capabilities and measures 336mm in length, 140mm in width, and 58mm in height. It has an ATX PCB form factor and is compatible with DirectX 12 Ultimate and OpenGL 4.6. A recommended power supply of 750W is required, and the card has a single 16-pin power connector. ",
      "price": "128000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX­­ 4070 Ti GAMING OC 12G",
        "coreClock": "2640 MHz (Reference card : 2610 MHz)",
        "memoryClock": "21 Gbps",
        "busType": "192 bit",
        "dimension": "L=336 W=140 H=58 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/geforce-rtx-4080-16gb-gaming-oc/geforce-rtx-4080-16gb-gaming-oc-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card",
      "category": "GPU",
      "description": "The GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card, based on the Ada Lovelace architecture and designed to handle the graphical demands of 8K gaming and high frame rates, brings the power of real-time ray tracing and AI to your PC games. The GPU has 16GB of GDDR6X VRAM and a 256-bit memory interface, which provides better performance and power efficiency than the previous Ampere-based iteration. The card's front panel includes several outputs, including DisplayPort 1.4a and HDMI 2.1. HDMI 2.1 provides up to 48 Gb/s bandwidth and a variety of higher resolutions and refresh rates, including 8K at 60 frames per second, 4K at 120 frames per second, and even 10K. The RTX 4080 is about more than simply high-resolution gaming. Computationally intensive programs can use the 9728 cores of the GPU to expedite processes using CUDA and other APIs. Gigabyte used the WINDFORCE cooling technology for cooling. The three fans rotate in opposite directions to decrease turbulence and boost airflow pressure. When the GPU is running a low-load or low-power game, the 3D Active Fan provides semi-passive cooling, and the fans turn off. The triangle fan edge splits the airflow, which is then steered smoothly along the 3D stripe curve on the fan surface. The graphene nano lubricant can improve the life of the fans while also making them quieter. It also offers RGB Fusion, which includes color customization and a range of lighting effects. It may also be used to sync with other AORUS devices. The GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card comes with a 02-year warranty.",
      "price": "181000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX 4080 16GB GAMING OC",
        "coreClock": "2535 MHz (Reference Card: 2505 MHz)",
        "memoryClock": "22.4 Gbps",
        "busType": "256 bit",
        "dimension": "L=342 W=150 H=75 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphich card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for extream budget"
        }
      ]
    }
  ]
}



[
  {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/amd/5600x/5600x-001-500x500.jpg",
      "productName": "AMD Ryzen 5 5600 Processor",
      "category": "Processor",
      "description": "AMD Ryzen 5 5600 Processor has 6 processor cores, 12 threads, and an astonishingly efficient 45-65W TDP. This processor stands with 3.5GHz Base Clock, 4.4GHz Max Boost Clock, 3MB L2 Cache, 32 MB L3 Cache with AM4 Package, and TSMC 7nm FinFET CMOS. This processor is built with PCIe 3.0 x8 and Wraith Spire Thermal Solution. The AMD Ryzen 5 5600 Processor provides DDR4 Up to 3200MHz memory with 2 memory channels. It has AMD StoreMI Technology which is a fast and easy way to expand and accelerate the storage in a desktop PC with an AMD Ryzen processor. AMD StoreMI technology is a powerful tool for PC enthusiasts that want to improve load times, boot times, file management, or system responsiveness. Whatever your storage acceleration needs, AMD StoreMI technology automatically pairs your most-used files with an SSD cache for peak performance. MD StoreMI technology can get files running at SSD-like speeds. Simply add an SSD to your system and let StoreMI do the rest. It also has AMD 'Zen 3' Core Architecture with the fastest cores in the world for PC gamers. The 'Zen 3' architecture represents the most comprehensive design overhaul of the 'Zen' era. Over 20 major changes include wider and more flexible execution resources; significantly more load/store bandwidth to feed execution; and a streamlined front-end to get more threads in flight and do it faster. The 'Zen 3' architecture can extract an average of 19% additional performance from every MHz of frequency relative to the previous generation2. This is a historically large generational improvement in IPC and a major player in this architecture's ability to deliver unmatched single-core performance. The 'Zen 3' architecture transitions to a new 'unified complex' design that brings 8 cores and 32MB of L3 cache into a single group of resources. This dramatically reduces core-to-core and core-to-cache latencies by making every element of the die a next-door neighbor with minimal communication time. Latency-sensitive tasks like PC gaming especially benefit from this change, as tasks now have direct access to twice as much L3 cache versus the Zen 2. It also features the AMD Ryzen VR-Ready Premium for the best possible VR experience possible. AMD Ryzen 5 5600 Processor offers a 3-Year Warranty.",
      "price": "14300",
      "status": "In Stock",
      "rating": 4.5,
      "keyFeatures": {
        "brand": "Ryzen",
        "model": "Ryzen 5 5600",
        "speed": "3.5GHz up to 4.4GHz",
        "cache": "L2: 3MB, L3: 32MB; Cores-6 & Threads-12"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/intel/core-i3-13100/core-i3-13100-01-500x500.webp",
      "productName": "Intel 13th Gen Core i3-13100F Raptor Lake Processor",
      "category": "Processor",
      "description": "The Intel 13th Gen Core i3-13100F Raptor Lake Processor is a quad-core, eight-thread processor with a base clock speed of 3.40 GHz and a maximum turbo frequency of 4.50 GHz. It features 12 MB of L3 cache and is compatible with the LGA 1700 socket. It is a part of Intel's 13th generation of processors built on the Raptor Lake architecture. It is designed for use on desktops and workstations. The Intel Core i3-13100F is compatible with LGA 1700 socket motherboards with the Intel 600 or 700 series chipset. It comes with support for PCI Express 5.0 and dual-channel DDR5 memory at 4800 MHz, making it ideal for office applications.",
      "price": "14000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Core i3-13100F",
        "speed": "3.40 GHz up to 4.50 GHz",
        "cache": "12 MB"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/i3-10100/i3-10100-500x500.jpg",
      "productName": "Intel 10th Gen Core i3 10100 Processor",
      "category": "Processor",
      "description": "This processor comes with a new breed that come with an enabled integrated GPU, so a separate graphics card is not required for its functionality. This new 10th gen Comet Lake microarchitecture is manufactured with the 14nm process that comes with four cores but lacks in HyperThreading. As this chip is updated to the latest BIOS revision, it nicely fits into any Intel 300-series motherboard. Focusing on this, all the major motherboard manufacturers have already started BIOS updates for their 300-series lineup",
      "price": "11300",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Intel Core i3 10100",
        "speed": "3.60 up to 4.30 GHz",
        "cache": "6M Cache"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/AMD/ryzen-3-4100/amd-ryzen-3-4100-01-500x500.jpg",
      "productName": "AMD Ryzen 3 4100 Processor",
      "category": "Processor",
      "description": "AMD Ryzen 3 4100 Processor has 4 processor cores, 8 threads, and an astonishingly efficient 45-65W TDP. This processor stands with a Base Clock of 3.8GHz and a Maximum Boost Clock of 4.0GHz. It has 256KB L1 Cache. 2MB L2 Cache, 4MB L3 Cache with AM4 Package, and TSMC 7nm FinFET CMOS. This AMD processor is built with PCIe 3.0 x8 and Wraith Spire Thermal Solution. This Processor provides DDR4 Up to 3200MHz memory with 2 memory channels. It has AMD StoreMI Technology, AMD 'Zen 2' Core Architecture, and AMD Ryzen VR-Ready Premium. The built-in AMD StoreMI Technology is a fast and easy way to expand and accelerate the storage in a desktop PC with an AMD Ryzen processor. AMD StoreMI technology is a powerful tool for PC enthusiasts that want to improve load times, boot times, file management, or system responsiveness. Whatever your storage acceleration needs, AMD StoreMI technology automatically pairs your most-used files with an SSD cache for peak performance. AMD StoreMI technology can get files running at SSD-like speeds. Simply add an SSD to your system and let StoreMI do the rest. It also features the AMD Ryzen VR-Ready Premium for the best possible VR experiences. It comes with Wraith Stealth Cooling Solution. These AMD Ryzen processors are designed to bring you the ultimate, high-performance computing experience. The latest revolutionary AMD multi-threaded processing technology gives you blazing fast performance when you work or play. This AMD Processor. Support AMD Socket AM4 Socket With AMD SenseMI technology and Powerful Overclocking Utility for AMD Ryzen processor. AMD Ryzen 3 4100 Processor offers a 3-years warranty(No Warranty for Fan or Cooler)",
      "price": "10300",
      "status": "In Stock",
      "rating": 4,
      "keyFeatures": {
        "brand": "Ryzeb",
        "model": "Ryzen 3 4100",
        "speed": "3.8GHz; Up to 4.0GHz",
        "cache": "256KB; L2 Cache: 2MB; L3 Cache: 4MB"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/core-i5-13600k/Core%20i5%2013600K-01-500x500.webp",
      "productName": "Intel 13th Gen Core i5 13600K Raptor Lake Processor",
      "category": "Processor",
      "description": "The Intel Core i5-13600K 3.5 GHz 14-Core LGA 1700 Processor will boost your productivity, gaming, and content production. This 13th-generation desktop CPU expands on the Hybrid Core design and Intel 7 process by packing 14 cores onto a single chip, four more than the prior generation, while still fitting the LGA 1700 socket. The Core i5-13600K is designed to deliver powerful performance for everyday workloads, with eight low-voltage Efficient-cores handling background tasks for multitasking and six 3.5 GHz Performance-cores powering programs and games. The built-in Intel Thread Director guarantees that the two function in unison by dynamically and intelligently distributing tasks to the appropriate core at the appropriate moment. With 24MB of cache and a Turbo Boost Max 2.0 clock of 5.1 GHz, this CPU is designed to handle a wide range of workloads. This CPU may also be overclocked for increased performance. PCI Express 5.0 and dual-channel DDR5 ECC memory at 5600 MHz are also supported by the Core i5-13600K. The Core i5-13600K has integrated Intel UHD 770 Graphics. It provides quick, rich 3D performance for high-quality images, with support for one 7680 x 4320 resolution 8K monitor or up to four 3840 x 2160 resolution 4K monitors with great dynamic range. The Intel 13th Gen Core i5 13600K Processor comes with a 03-year warranty.",
      "price": "36000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Intel",
        "model": "Core i5 13600K",
        "speed": "3.50 GHz up to 5.10 GHz",
        "cache": "24 MB, Socket: LGA1700"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing processor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for High budget"
        }
      ]
    },{
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/msi/pro-b660m-g-ddr4/pro-b660m-g-ddr4-01-500x500.jpg",
      "productName": "MSI PRO B660M-G DDR4 12th Gen mATX Motherboard",
      "category": "Motherboard",
      "description": "MSI PRO B660M-G DDR4 motherboard supports with 12th Gen Intel Core, Pentium Gold and Celeron processors for LGA 1700 socket, DDR4 Memory, up to 4600+(OC) MHz. This motherboard comes with premium layout and digital power design to support more cores and provide better performance. In thihs bmotherboard, the Advanced technology to deliver pure data signals for the best performance, stability and compatibility. It has PCIe 4.0, Lightning Gen4 x4 M.2 with M.2 Shield Frozr. With 2.5G LAN, This 2.5Gbps LAN provides incredible data transfer speed faster than general Gigabit LAN. This is a premium solution for demanding users. You can Upgraded network solution for professional and multimedia use and also it Delivers a secure, stable and fast network connection. This motherboard comes with Steel Armor, which helps to Protecting VGA cards against bending and EMI for better performance, stability and strength. The latest MSI PRO B660M-G DDR4 motherboard offers 03 year warranty.",
      "price": "16499",
      "status": "In Stock",
      "rating": 4,
      "keyFeatures": {
        "brand": "MSI",
        "model": "PRO B660M-G DDR4",
        "SupportedProcessors": "12th Gen Intel Core, Pentium Gold & Celeron processors",
        "SupportedMemory": "DDR4, up to 4600+(OC) MHz",
        "GraphicsOutput": "2 x DisplayPort, 1 x VGA, 1 x HDMI"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/asus/pro-b760m-c-csm/pro-b760m-c-csm-01-500x500.webp",
      "productName": "ASUS PRO B760M-C-CSM 13th Gen Micro-ATX Motherboard",
      "category": "Motherboard",
      "description": "The ASUS PRO B760M-C-CSM is a 13th gen micro-ATX motherboard designed for business use. It supports Intel's LGA1700 socket, making it compatible with 13th Gen Intel Core processors as well as 12th Gen Intel Core, Pentium Gold, and Celeron processors. The motherboard features the Intel B760 chipset and supports up to 192GB of DDR5 memory with speeds up to 6200(OC). It has four DIMM slots with support for dual-channel memory architecture and Intel Extreme Memory Profile (XMP). The Pro B760M-C-CSM provides multiple connectivity options, including 2 x DisplayPort, 1 x VGA port, and 1 x HDMI port. It offers expansion slots such as 1 x PCIe 4.0/3.0 x16 and 2 x PCIe 3.0 x1 for additional devices. Storage options include 2 x M.2 slots and 4 x SATA 6Gb/s ports, and it also features 1 x Intel 1Gb Ethernet port for network connectivity. The motherboard offers various USB ports, audio support with a Realtek 7.1 Surround Sound High Definition Audio CODEC, and comes with ASUS Q-Design features for easy installation and maintenance. It is designed with business-focused features like ASUS Self Recovering BIOS, ASUS Event Log, and 24/7 reliability. The ASUS PRO B760M-C-CSM is a reliable and feature-rich motherboard suitable for business users in need of a compact form factor.",
      "price": "19800",
      "status": "In Stock",
      "rating": 4.5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "PRO B760M-C-CSM",
        "SupportedProcessors": "13th Gen & 12th Gen Processors (LGA1700)",
        "SupportedMemory": "4 x DIMM, Max. 192GB, DDR5 6200(OC)",
        "GraphicsOutput": "2 x DisplayPort, 1 x VGA, 1 x HDMI"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/asus/tuf-gaming-b650-plus/tuf-gaming-b650-plus-01-500x500.webp",
      "productName": "Asus TUF GAMING B650-PLUS DDR5 AM5 ATX Motherboard",
      "category": "Motherboard",
      "description": "The Asus TUF GAMING B650-PLUS Motherboard combines all of the necessary components of the newest AMD Ryzen 7000-series CPUs with game-ready features and proven endurance. This motherboard exceeds expectations with rock-solid and reliable performance for marathon gaming, thanks to military-grade components, an enhanced power solution, and a sophisticated cooling system. TUF GAMING motherboards are also subjected to extensive durability testing to guarantee that they can withstand situations that might cause other motherboards to fail. This model has tough off-black and geometric design elements to highlight the durability and stability that characterize the TUF GAMING line. This Asus TUF GAMING B650 motherboards offer a feature-rich high-performance gaming package that includes ultrafast networking for smoother online gameplay, pristine audio with positional cues for FPS gaming, and onboard RGB lighting that syncs with attached gear to personalize your gaming environment. To experience superior performance, build your next setup using an AMD Ryzen 7000 Series processor and ASUS TUF GAMING motherboards. The AMD Ryzen 7000 Series puts you ahead of the game with up to 16 'Zen 4' cores and 32 threads, peak frequencies of up to 5.7GHz, and an 80MB cache. With AMD Socket AM5, you'll also have access to additional capabilities for gamers, such as DDR5 memory speed and PCIe 5.0 improved bandwidth. AMD Ryzen 7000 Series CPUs and AMD socket AM5 motherboards are overclockable, allowing you to customize your experience. Overclock your DDR5 memory with AMD EXPO technology to get even greater performance.",
      "price": "30000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "TUF GAMING B650-PLUS",
        "SupportedProcessors": "Ryzen 7000 Series Processors for Socket AM5",
        "SupportedMemory": "4x DDR5, up to 128GB, 6400+(OC)",
        "GraphicsOutput": "1x HDMI, 1x Display Port"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/gigabyte/z790-aorus-elite-ax/z790-aorus-elite-ax-01-500x500.webp",
      "productName": "GIGABYTE Z790 AORUS ELITE AX 13th & 12th Gen ATX Motherboard",
      "category": "Motherboard",
      "description": "The GIGABYTE Z790 AORUS Elite AX ATX Motherboard comes with Intel Socket LGA 1700 that supports 13th and 12th Gen Series Processors. It delivers unparalleled performance with twin 16+1+2 Phases Digital VRM Solution. The motherboard comes with 4x SMD DIMMs with XMP 3.0 Memory Module Support. It offers support for DDR5 7600(O.C.) /7400(O.C.) /7200(O.C.) /7000(O.C.) /6800(O.C.) /6600(O.C.) / 6400(O.C.) / 6200(O.C.) / 6000(O.C.) / 5800(O.C.) / 5600(O.C.) / 5400(O.C.) / 5200(O.C.) / 4800 / 4000 memory modules. The sockets support up to 128 GB (32 GB single DIMM capacity) of system memory. The motherboard is equipped with the PCIe 5.0 x16 slot and M.2 socket designed to optimize multitasking and large workloads, which is also ready for a new PCIe 5.0 graphics card or storage device. It supports new PCIe 5.0 SSD with up to type 25110 M.2 slot designed to provide high power M.2 PCIe 5.0 SSD solutions. The GIGABYTE Z790 AORUS ELITE AX is equipped with Intel 2.5Gb Ethernet provides an immediate boost to overall network performance, smooth video editing, and fast data transfers. Wi-Fi 6E brings the ability to conduct AR/VR experiences, get creative with fewer dropped connections, and download large files at faster speeds without lag. The advanced cooling solution also provides the perfect aesthetic heatsink design to keep your PC at an optimal temperature, preventing you from unexpected system crashes during the creative process. The GIGABYTE Z790 AORUS ELITE AX ATX Motherboard comes with 3 years of warranty.",
      "price": "40500",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "Z790 AORUS ELITE AX",
        "SupportedProcessors": "13th Gen & 12th Gen Processors (LGA1700)",
        "SupportedMemory": "4 x DDR5 DIMMs, up to 7600(O.C.)",
        "GraphicsOutput": "1 x HDMI, 1 x DisplayPort"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/motherboard/msi/meg-x670e-ace/meg-x670e-ace-01-500x500.webp",
      "productName": "MSI MEG X670E ACE DDR5 AMD AM5 E-ATX Motherboard",
      "category": "Motherboard",
      "description": "The MSI MEG X670E ACE Motherboard supports AMD's Ryzen 7000-series processors with up to 16 Zen 4 cores as well as dual-channel DDR5 memory, Maximum Memory Capacity of up to 128GB. It features a 22+2+1 phases power design with 90A Power Stage and dual CPU power connectors ready to unleash the maximum performance. It has a stacked Fin Array, Direct Touch VRM Heat-pipe, MOSFET Baseplate, 7W/mK thermal pads, double-sided M.2 Shield Frozr, and Frozr AI software to ensure extreme performance with low temperature. The motherboard is made of an 8 Layer PCB with 2oz Thickened Copper that provides higher performance and long-lasting system stability without any compromise. The MSI MEG X670E ACE offers onboard and exclusive M.2 XPANDER-Z GEN5 DUAL PCI-Express card offer totally sextuple M.2 connectors for maximum storage performance. It can deliver a lightning-fast game experience with PCIe 5.0 slots, Lightning Gen 5 x4 M.2, Front USB 3.2 Gen 2x2 20G with 60W USB Power Delivery. The double-sided Shield Frozr design keeps M.2 SSDs safe while preventing throttling, making them run faster. The rear I/O panel now offers easy ways of directly entering the safe boot, a one-click toggle for all RGB lights, and directly activating Turbo mode. The MSI MEG X670E ACE Motherboard offers 2x PCIe Gen 5 x16 slots and 4x M.2 slots. The MEG series offers a stacked fin array heatsink and a heatpipe along with a MOSFET baseplate for effective heat dissipation from the VRMs. The MSI MEG X670E ACE comes with 3 years of warranty.",
      "price": "97000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "MSI",
        "model": "MEG X670E ACE",
        "SupportedProcessors": "Ryzen 7000 Series Processors for Socket AM5",
        "SupportedMemory": "4x DDR5, Max 128GB",
        "GraphicsOutput": "1x Type-C Display port"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an out standard motherboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/vengeance-rgb-rs/vengeance-rgb-rs-01-500x500.webp",
      "productName": "CORSAIR VENGEANCE RGB RS 8GB DDR4 3600MHz RAM",
      "category": "Ram",
      "description": "The CORSAIR VENGEANCE RGB RS 8GB DDR4 3600MHz RAM features individually addressable RGB lighting while delivering outstanding performance optimized for Intel and AMD motherboards. It is compatible with Intel 300 Series, Intel 400 Series, Intel 500 Series, Intel 600 Series, AMD 300 Series, AMD 400 Series, and AMD 500 Series. Illuminate your system with dynamic RGB lighting from six individually addressable RGB LEDs, encased in a panoramic light pipe that offers unobstructed viewing from virtually every angle. This desktop RAM features a beautifully designed aluminum heat spreader that conducts heat away from your memory for superb cooling even when overclocked, with modern styling to complement your RGB lighting. It has been engineered for performance with a custom high-performance PCB and carefully screened memory chips deliver maximum bandwidth and tight response times. The CORSAIR VENGEANCE RGB RS comes with a lifetime warranty.",
      "price": "4200",
      "status": "In Stock",
      "rating": 4.3,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "VENGEANCE RGB RS",
        "frequency": "3600Mhz",
        "capacity": "8GB (1 x 8GB)",
        "voltage": "1.25V/C36"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/gskill/trident-z-neo/trident-z-neo-001-500x500.jpg",
      "productName": "G.Skill Trident Z NEO RGB 32GB DDR4 3600MHz Gaming Desktop RAM",
      "category": "Ram",
      "description": "The latest G.Skill Trident Z NEO RGB Gaming Desktop RAM brings unparalleled memory performance and vibrant RGB lighting to any gaming PC or workstation with latest AMD Ryzen CPUs and AMD DDR4 motherboards, It engineered and optimized for full compatibility on the latest AMD Ryzen platforms. This RAM is designed for memory performance with the latest AMD Ryzen platforms, Trident Z Neo is optimized to unlock the full potential of the AMD platform to its maximum speed and also featured with a contrast of black brushed aluminum and powder-coated silver, the Trident Z Neo dual-toned heatspreader adds power and boldness to your next-gen build. The Trident Z Neo features a beveled edge along the top of the signature tri-fin design with the asymmetrical slant to achieve a sleek and clean look. It is crafted with hand-screened memory ICs and custom 10-layer PCBs, each and every module is made for maintaining the best signal integrity to achieve fast overclocking performance. This RAM is fully control and customize the 8-zone RGB lighting through the downloadable Trident Z Lighting Control software.",
      "price": "11800",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "G.Skill",
        "model": "Trident Z NEO RGB",
        "frequency": "3600MHz",
        "capacity": "32GB",
        "voltage": "1.35V; unbuffered"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/vengeance-rgb/vengeance-rgb-01-500x500.webp",
      "productName": "Corsair VENGEANCE RGB 32GB (2x16GB) DDR5 5600MHz C36 AMD EXPO RAM Kit",
      "category": "Ram",
      "description": "The Corsair VENGEANCE RGB 32GB (2x16GB) DDR5 5600MHz C36 AMD EXPO RAM Kit is a high-performance memory kit designed for AMD motherboards. With a capacity of 32GB, it provides ample memory for demanding tasks and applications. The DDR5 technology ensures faster data transfer rates and improved overall performance compared to its DDR4 counterparts. Operating at a frequency of 5600MHz, this RAM kit delivers exceptional speed and responsiveness, allowing for smooth multitasking and seamless gaming experiences. The 288-pin form factor ensures compatibility with most modern motherboards, providing easy installation and setup. The voltage and CAS latency of the Corsair VENGEANCE RGB DDR5 RAM is optimized for efficient performance. With a voltage of 1.25V and a CAS latency of C36, the RAM operates at an optimal power level while maintaining low latency for faster data access. This RAM kit is the ten-zone RGB lighting. The RGB lighting adds a vibrant and customizable visual element to your PC, allowing you to personalize the aesthetics and create stunning lighting effects. You can sync the lighting with other compatible RGB components to create a unified lighting theme throughout your system. The Corsair VENGEANCE RGB 32GB DDR5 RAM Kit is an excellent choice for users who prioritize performance and aesthetics. It offers high-speed DDR5 memory, optimized for AMD motherboards, and features customizable RGB lighting to enhance the visual appeal of your cutting-edge PC build.",
      "price": "17500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "VENGEANCE RGB",
        "frequency": "DDR5 5600MHz",
        "capacity": "32GB",
        "voltage": "1.25V/C36"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/cosair/dominator-platinum-rgb-ddr5/dominator-platinum-rgb-01-500x500.webp",
      "productName": "Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit",
      "category": "Ram",
      "description": "The Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit is a high-performance memory kit designed for gaming enthusiasts and content creators. With the advent of DDR5 technology, this RAM kit offers unprecedented processing speed, allowing your high-end CPU to access data quickly and efficiently. No matter the task at hand, whether it's gaming, content creation, multitasking, or even opening numerous browser tabs, this RAM kit ensures that your gaming PC can handle complex tasks faster than ever before. It provides the power and control you need for demanding applications. The DOMINATOR PLATINUM RGB RAM kit features built-in voltage regulation, which, when combined with the iCUE software control, allows for easier and more precise voltage output adjustments. This feature contributes to more stable overclocking capabilities, enabling you to push your system's performance to its limits while maintaining stability. This RAM kit is the ability to save your own AMD EXPO profiles through the iCUE software. This eliminates the need for manually adjusting performance settings each time you switch tasks or applications. You can easily customize and tailor your setting profiles based on specific apps or tasks, enhancing overall efficiency and saving you time. Corsair ensures wide compatibility with their memory finder tool. This tool is integrated directly into the memory page, offering a user-friendly interface to help you find the best memory kit that suits your system's configuration. It provides a range of options to ensure compatibility, ensuring you are paired up with the most suitable memory kit for your needs. The Corsair DOMINATOR PLATINUM RGB 32GB (2x16GB) DDR5 5200MHz C40 AMD EXPO RAM Kit delivers exceptional performance, stability, and customization options. It is a reliable choice for users seeking top-tier memory modules to optimize their gaming and content creation experiences.",
      "price": "22500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "DOMINATOR PLATINUM RGB",
        "frequency": "DDR5 5200MHz",
        "capacity": "32GB (2x16GB)",
        "voltage": "1.25V/40-40-40-77"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ram/team/delta-rgb/delta-rgb-01-500x500.webp",
      "productName": "TEAM T-FORCE DELTA RGB 32GB (16GBx2) 7600MHz DDR5 Gaming RAM",
      "category": "Ram",
      "description": "The TEAM T-FORCE DELTA RGB DDR5 Desktop Gaming RAM comes with 32GB (16GBx2) capacity and 7600MHz  Speed. The RAM features RGB Colors & 120° Ultra-Wide Lighting, Power Management ICs (PMIC) Equipped for Stable, Efficient Power Usage Strengthened PMIC Cooling Design, and On-die ECC for Stable systems. This Gaming RAM supports Intel XMP3.0 for One-Click Overclocking. This RAM has High-Quality ICs Selected for Stability & Reliability. The TEAM T-FORCE DELTA RGB Desktop Gaming RAM is equipped with Smart RGB IC Controller that Supports Various Lighting Effect Software.",
      "price": "47798",
      "status": "In Stock",
      "rating": "4.5",
      "keyFeatures": {
        "brand": "T-FORCE",
        "model": "T-FORCE DELTA RGB DDR5",
        "frequency": "7600MHz",
        "capacity": "32GB (16GBx2)",
        "voltage": "1.25V/40-40-40-77"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an standard ram"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for High budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/Antec/neoeco-gold-650w/neoeco-gold-650w-01-500x500.webp",
      "productName": "Antec NeoEco Gold 650W Modular Power Supply",
      "category": "Power-supply",
      "description": "The new Antec NeoEco Gold 650W Modular Power Supply is designed for the most ardent DIY-PC enthusiasts, and it also provides great performance and stability. The NeoECO Gold Modular line, with its 100% complete modular design and 80 PLUS Gold certifications, keeps your PC hardware installation simple and clean. It continues to supply highly efficient power to your system while lowering your utility costs. The innovative thermal control with Zero RPM mode allows the fan to be turned off at low loads for complete silence. The NeoECO Gold Modular can improve the balance between cooling and noise with its 120mm quiet fan. High-quality Japanese heavy-duty caps provide more reliable performance for your system. The CircuitShield design provides industry-grade protection for your system, keeping it secure in any environment. It boasts a 120mm Silent Fan, improved airflow, and exceptional longevity. The Zero RPM fan mode also assures zero fan speed at low loads, reducing noise and maintaining total silence. The Antec NeoEco Gold 650W Modular Power Supply comes with a 07-year warranty.",
      "price": "8500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "NEOECO",
        "model": "NeoEco Gold 650W",
        "Certification": "80 Plus Gold",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "ATX 12V 2.4",
        "voltage": "100-240 VAC"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/corsair/rm1000e/rm1000e-01-500x500.webp",
      "productName": "Corsair RM1000e 1000W 80 Plus Gold Fully Modular Power Supply",
      "category": "Power-supply",
      "description": "The Corsair RM1000e is a Fully Modular Low-Noise Power Supply that provides your PC with quiet, consistent power with 80 PLUS Gold efficiency. RMe PSUs provide the connections needed to power today's demanding PC gear, including two 8-pin EPS12V cables and a variety of PCIe 8-pin power connectors. Industrial-grade, 105°C-rated capacitors provide excellent electrical performance and are covered by a seven-year guarantee. With support for the new Modern Standby sleep mode, you can wake up your computer faster and use less power. Fully modular cables make PC construction simple since you just connect the cables your system requires. The CORSAIR RMe Series offers consistent power for your system, with a 140mm-long shell that works with practically any current chassis.",
      "price": "18000",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "RM1000e",
        "Certification": "80 PLUS Gold Certification",
        "frequencyRange": "47 ~ 63 Hz",
        "modularType": "Fully",
        "voltage": ""
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/antec/signature-platinum-1300/signature-platinum-1300-01-500x500.jpg",
      "productName": "Antec Signature PLATINUM 1300 1300W 80 Plus Platinum Fully Modular Power Supply",
      "category": "Power-supply",
      "description": "The Antec Signature PLATINUM 1300 is an 80 Plus Platinum Power Supply that is equipped with superior features that ensure peak performance for the enthusiast and gaming-oriented segment, the Signature power supply Series boasts unparalleled stability and 80 PLUS Platinum-certified efficiencies. At 20% / 50% / 100% load AC 115V internal, the power efficiency should be at least 90% / 92% / 89%. It has an output capacity of 1300w. Advanced thermal control with the Zero RPM mode enables the optimal balance between silence and cooling. It ensures a longer-lasting and quieter system by using thermal sensors to activate the fan only when you need it. The CircuitShield suite of industrial-grade protections ensures that the power delivered to your system is safe and reliable in any environment. Signature Series are a great choice for a reliable and efficient PC system for gamers and professionals. The Antec Signature PLATINUM 1300 features whisper-quiet, fluid dynamic bearing 135mm fan that provides high airflow with durability and longevity. It also has a server-class full-bridge LLC design with a synchronous rectification based on a DC-DC topology. It allows 2 Signature PSUs to work in tandem to power the most demanding systems. It is a fully modular PSU. It enables users to use only the cables which are needed and help clear out excess cables that can obstruct and reduce airflow. The Antec Signature PLATINUM 1300 comes with 10 years of warranty.",
      "price": "27000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ANTEC",
        "model": "SP1300 Platinum",
        "Certification": "80 Plus Platinum",
        "frequencyRange": "47Hz ~ 63Hz",
        "modularType": "Fully",
        "voltage": "1300W"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/corsair/hx1500i-1500w/hx1500i-1500w-01-500x500.webp",
      "productName": "Corsair HX1500i 1500W 80+ Platinum Full-Modular ATX Power Supply",
      "category": "Power-supply",
      "description": "The Corsair HXi Series Fully Modular Power Supply is Ultra-Low Noise with three EPS12V connections and employs the finest quality components to produce 80 PLUS Platinum efficient power. With three EPS12V ports and completely modular wiring, HXi Series platinum power supplies provide every connection needed to support today's most demanding PC upgrades now and in the future, including the newest generation of power-hungry graphics cards and CPUs. The HXi Series PSUs have a 140mm fluid dynamic bearing fan with Zero RPM mode support for long-lasting fan performance and near-silent operation when the fan shuts off at low and medium loads, only spinning as fast as needed. HXi PSUs are 80 PLUS Platinum certified and use quality 100% Japanese 105°C electrolytic capacitors for outstanding power delivery and long-term dependability with low power consumption, reduced noise, and lower temperatures. CORSAIR iCUE software integrates your whole setup, resulting in a fully immersive ecology with straightforward control. The Corsair HX1500i 1500W 80+ Platinum Full-Modular ATX Power Supply comes with a 10-year warranty.",
      "price": "45000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "HX1500i 1500W",
        "Certification": "80 PLUS Efficiency Platinum",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "Fully Modular",
        "voltage": "100 - 240V"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/power-supply/asus/thor-1200p2/thor-1200p2-500x500.webp",
      "productName": "ASUS ROG THOR 1200P2 GAMING 80 Plus Platinum 1200W Power Supply",
      "category": "Power-supply",
      "description": "The inbuilt OLED monitor in the ROG Thor 1200P Platinum Power Supply Unit provides a real-time display of power consumption. Now you can easily check how much electricity your apparatus is using. To improve component lifespan, the ROG Thor 1200W Platinum has a 135mm unique Wing-blade fan. The fan is kept spinning freely thanks to IP5X dust protection, and 0dB technology makes use of thermal sensors to enable the fan to entirely shut off at lower wattages for absolutely silent operation. The integrated ROG heatsinks are 20% cooler inside the ROG Thor 1200W Platinum thanks to their 2x larger capacity than conventional designs. As a result, components last longer and can operate at 0dB for longer than in conventional designs. Given how efficient the heatsinks are, the fan",
      "price": "50000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "THOR 1200P2",
        "Certification": "Lambda A++ Certification",
        "frequencyRange": "50Hz-60Hz",
        "modularType": "Fully modular",
        "voltage": "100 - 240V"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing power supply"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
{
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/samsung/980-1tb/980-1tb-500x500.jpg",
      "productName": "Samsung 980 1TB PCIe 3.0 M.2 NVMe SSD",
      "category": "Storage",
      "description": "The Samsung 980 1TB PCIe 3.0 M.2 NVMe SSD is a super fast processing storage unit that is 3 times faster then conventional hard disk drives. The Samsung 980 1TB SSD is designed with PCIe Gen 3.0 x4, NVMe 1.4 interface that enables it to work faster and efficiently then other M.2 SSDs. The SSD is designed with 1,500 G & 0.5 ms (Half sine) which is able to protect the internal structure of the SSD and save all the data that have been stored inside. The Samsung 980 1TB SSD is designed and programmed with TRIM AND SMART support.",
      "price": "7690",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "SAMSUNG",
        "model": "980 1TB",
        "formFactory": "M.2 (2280)",
        "mtbf": "1.5 Million Hours",
        "dimension": "3.15' X 0.94' X 0.87'",
        "weight": "1.92 oz"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/zadak/twss3/twss3-500x500.jpg",
      "productName": "ZADAK TWSS3 1TB SATA3 2.5' SSD",
      "category": "Storage",
      "description": "The ZADAK TWSS3 1TB SATA3 2.5' SSD is a high-speed SSD that comes with the SATA III 6Gbps interface. It can reach the sequential read and write speed of up to 560/540 MB/s. 3D NAND technology not only for higher capacities but also to help reduce cell-to-cell interference for enhanced reliability. It effectively eliminates Power Consumption Optimized Durability and Performance at High Stability, High Capacity with Enhanced Reliability making It a primal Choice for PC Upgrade. It operates with low power, 95% less than conventional computer hard drives. It comes with Optimized Durability and Performance at High Stability. Advanced Wear Leveling, ECC and supports TRIM command to extend the lifespan with stability and maintain the performance highly efficient even after long-term usage. It can withstand critical vibration criteria at 15G, and shock at 1500G. Thereâ€™s no need to worry about hard drive failure and data corruption even on the go. The ZADAK TWSS3 offers 5-Year Limited Warranty.",
      "price": "9700",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "ZADAK",
        "model": "TWSS3",
        "formFactory": "2.5'",
        "mtbf": "1,500,000 hours",
        "dimension": "100mm x 69.9mm x 7mm",
        "weight": "1.92 oz"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/seagate/barracuda-q5-1tb/barracuda-q5-1tb-01-500x500.jpg",
      "productName": "Seagate BarraCuda Q5 1TB NVMe M.2 Internal SSD",
      "category": "Storage",
      "description": "The Seagate BarraCuda Q5 1TB NVMe M.2 SSD provides up to 50x quicker performance than traditional hard drives. With its 3D QLC NAND technology and M.2 2280 form size, this SSD provides up to 50x quicker performance than standard hard drives. It employs the PCIe 3.0 x4 / NVMe 1.3 interface, which ensures consistent and efficient data transfer rates. The Seagate BarraCuda Q5 SSD features exceptional sequential read and writes speeds of up to 2400 MB/s, making it suitable for demanding applications like gaming, video editing, and content production. It also has a mean time between failures (MTBF) of 1.8 million hours, which ensures long-term performance and dependability. This SSD has a total bytes written (TBW) capacity of 274TB, indicating that it can handle large quantities of data. It has SMART and TRIM support to assure the SSD's health and performance, which helps to maximize the drive's performance and avoid data loss. As an added benefit, Seagate gives the free SeaTools SSD software program to monitor the drive's performance, health, and firmware upgrades. This Seagate BarraCuda Q5 1TB NVMe M.2 Internal SSD is a superb storage option with remarkable speed, reliability, and durability, making it a perfect choice for individuals who expect the finest performance from their computer equipment.",
      "price": "2000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "BARACUDA",
        "model": "BarraCuda Q5",
        "formFactory": "M.2 2280",
        "mtbf": "1.8 Million Hours",
        "dimension": "0.9 x 0.08 x 3.1' / 22 x 2.15 x 80 mm",
        "weight": "0.02 lb / 9 g"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/samsung/870-qvo/870-qvo-1-500x500.jpg",
      "productName": "Samsung 870 QVO 4TB 2.5' SATA III SSD",
      "category": "Storage",
      "description": "Samsung 870 QVO 4TB 2.5' SATA III SSD The Samsung 870 QVO comes with a 4TB Capacity. This SSD features an expanded SATA interface limit of 560/530 MB/s sequential speeds, the 870 QVO improves random access speed and sustained performance. Intelligent TurboWrite accelerates write speeds and maintains long-term high performance with a larger variable buffer. The Samsung 870 QVO 4TB SSD increases reliability up to 360 TBW (terabytes written) using a refined ECC (error-correcting code) algorithm for stable performance. Its upgrading to 870 QVO is now easier than ever for anyone with a desktop PC or laptop that supports a standard 2.5-inch SATA form factor. Simply plug in the 870 QVO into a SATA slot and let the updated migration software take care of the rest. This SSD comes with SATA 6 Gbps Interface, compatible with SATA 3 Gbps & 1.5 Gbps interfaces. It supports Trim, S.M.A.R.T., GC (Garbage Collection), WWN Support, etc. This SSD is compatible with Windows10/ Windows 8/ Windows 7/ Windows Server 2003 (32 bit and 64 bit), Vista (SP1 and above), XP (SP2 and above), MAC OSX, and Linux operating system. The new Samsung 870 QVO SSD has 03 years of warranty.",
      "price": "31999",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "SAMSUNG",
        "model": "870 QVO",
        "formFactory": "2.5 inch, Capacity: 4TB",
        "mtbf": "1.5 Million Hours",
        "dimension": "3.94' X 2.76' X 0.27'",
        "weight": "0.19 lbs."
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/ssd/seagate/ironwolf-125-500gb/ironwolf-125-500gb-01-500x500.webp",
      "productName": "Seagate IronWolf 125 2TB 2.5-inch SATA III SSD",
      "category": "Storage",
      "description": "The Seagate IronWolf 125 2TB 2.5-inch SATA III SSD is designed for demanding workloads and multi-user NAS settings, and it provides powerhouse performance with 24/7, always-on capabilities. This 2TB SSD is compatible with Windows 10, 8.1, and Unix and features a SATA III 6 Gb/s interface, a 2.5' / 7mm form factor, sustained sequential read rates of up to 560 MB/s, and sustained sequential write speeds of up to 540 MB/s. It's IronWolf 125 SSD also boasts an MTBF rating of 1.8 million hours, 1 in 1017 non-recoverable read errors per bit read, a Total Bytes Written (TBW) capacity of up to 700TB, and 3D TLC NAND flash memory.",
      "price": "47500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IRONWOLF",
        "model": "IronWolf 125",
        "formFactory": "2.5 inch",
        "mtbf": "1.8 Million Hours",
        "dimension": "3.94 x 2.76 x 0.28' / 10 x 7 x 0.7 cm",
        "weight": "50g"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard SSD"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },

    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/uniview/mw3224-v/mw3224-v-500x500.webp",
      "productName": "Uniview MW3224-V 24' LED FHD Monitor With Built-In Speakers",
      "category": "Monitor",
      "description": "The Uniview MW3224-V 24' LED FHD Monitor has a 23.8-inch LED-backlit display with a 1920x1080 resolution and a 16:9 aspect ratio, which provides sharp and clear images with vibrant colors and broad viewing angles. The display also offers a quick 14ms reaction time and a refresh rate of 60Hz, assuring smooth and responsive performance while gaming, streaming video, and multitasking. The monitor has a VGA and an HDMI connector, so it may be connected to a variety of devices such as laptops, desktops, consoles, and media players. The Uniview MW3224-V 24' LED FHD Monitor also includes an in-built speaker system with a 3.5mm audio connection, providing rich and clear sound for your pleasure. The monitor has a clean and attractive design with a narrow bezel and a solid base that supports VESA installation. The display also offers an OSD menu in two languages (English and Simplified Chinese) for quick configuration adjustments. The Uniview MW3224-V 24' LED FHD Monitor consumes less than 24W when turned on and less than 0.5W when turned off, making it energy-efficient and environmentally friendly. The kit includes an HDMI cable, a power cable, an adapter, a pedestal, and a fast guide. The net weight of the monitor is 3.3kg (7.28lb), while the gross weight is 4.6kg (10.14lb). The dimensions of the display are 541.8mm x 412.6mm x 200mm (21.33' x 16.24' x 7.87').",
      "price": "12800",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "UNIVIEW",
        "model": "MW3224-V",
        "port": "1x VGA, 1x HDMI, 1x 3.5 mm",
        "display": "TIPO, 60Hz, 14ms",
        "features": "2x 1.5W Built-In Speakers",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/va249he/va249he-500x500.jpg",
      "productName": "Asus VA249HE 23.8 inch Full HD Eye Care Monitor",
      "category": "Monitor",
      "description": "Asus VA249HE 23.8 inch Full HD Eye Care Monitor.Flicker Free, Blue Light Filter, Anti Glare.It has 3,000:1 ultra high contrast and ASCR 100,000,000:1, 5ms(GTG)response time ensure better image quality. HDMI port for mutimedia and entertainment enjoyment.",
      "price": "20499",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "VA249HE",
        "port": "HDMI, VGA",
        "display": "VA, 60Hz, 5ms",
        "features": "Flicker Free, Low Blue Light",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/fantech/gm271sf/gm271sf-1-500x500.jpg",
      "productName": "Fantech GM271SF Chimera 27' 165Hz IPS FHD Gaming Monitor",
      "category": "Monitor",
      "description": "Fantech GM271SF Chimera 27' 165Hz Gaming Monitor is perfect for full-display gaming setups and content creation, with a 3-side borderless display that maximizes your viewing experience while minimizing frame distractions. It is equipped with a 1920x1080 resolution. The 165Hz Refresh Rate monitor combined with a 1ms response rate offers smoother, clearer action while reducing blur and ghosting. It has been designed for incredible speed. CHIMERA Fast IPS Display allows up to 4X faster than conventional IPS panels for improved response. With a 1ms response time, smearing and motion blur are virtually eliminated. It comes with the latest adaptive sync technology and it supports Freesync. Enjoy tear-free, shutter-free, fluid gaming. The monitor has been designed with a breathing lighting effect to enhance your gaming experience. It comes with a tilt base so you can tilt the display for the most comfortable viewing angle. The Fantech GM271SF Chimera 27' 165Hz Gaming Monitor comes with 1 year warranty",
      "price": "35000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "GM271SF Chimera",
        "port": "HDMI, DP, 3.5mm Audio Out",
        "display": "IPS, 165Hz, 1ms",
        "features": "Free Sync",
        "aspectRation": "1920 x 1080"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/vg259qm/vg259qm-500x500.jpg",
      "productName": "ASUS TUF Gaming VG259QM 24.5inch FHD 280Hz G-SYNC Overclockable Monitor",
      "category": "Monitor",
      "description": "Astonishing overclockable 280Hz refresh rate means the display is almost twice as fast as conventional 144 Hz monitors. You'll experience amazingly fluid gaming visuals, giving you the upper hand in first-person shooters, racing, real-time strategy, and sports titles. Fast IPS Display allows the display's liquid crystal elements to switch up to 4X faster than conventional IPS panels for improved response. With a 1 ms gray-to-gray response time, smearing and motion blur are virtually eliminated. This display also delivers superior images with outstanding colors thanks to 72% NTSC color gamut and an astounding 1,000:1 contrast ratio. Wide 178-degree viewing angles ensure minimal distortion and color shift even when you're viewing from extreme positions. With variable-refresh-rate (VRR) technology enabled by default, you're assured seamless, tear-free gaming experiences from your NVIDIA GeForce GTX 10 or NVIDIA GeForce RTX 20-series graphics card. HDR technology delivers a wider color range and higher contrast than traditional monitors. The brightest whites and the darkest blacks bring out details like never before. The display is also capable of 400 cd/m2, meeting the stringent requirements for DisplayHDR 400 certification. ASUS Dynamic Shadow Boost technology automatically clarifies dark areas of the game world with optimizing other areas, improving overall viewing while also making it easier to spot enemies hidden in shaded areas of the map. The ASUS-exclusive, integrated GamePlus hotkey offers in-game enhancements that help you get more out of your game. This function is co-developed with input from pro gamers, allowing them to practice and improve their gaming skills. ASUS GameVisual Technology has seven pre-set display modes to optimize visuals for different types of content. This unique feature can be easily accessed through a hotkey or the on-screen display settings menu. Flicker-Free technology reduces flicker to minimize eyestrain for improved comfort when you're embroiled in long gaming sessions. ASUS Ultra-Low Blue Light technology reduces the amount of potentially harmful blue light emitted by the display. Four different filter settings are available to control the amount of blue light reduction. Extensive connectivity options, including DisplayPort1.2, HDMI 2.0x2, and Earphone Jack offer support for wide array of multimedia devices. With an ergonomically-designed stand, it provides tilt, swivel, pivot, and height adjustments so you can easily find your ideal viewing position. The display is also VESA-compatible for wall mounting.",
      "price": "52000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "ASUS TUF VG259QM OC",
        "port": "HDMI, DP, 3.5mm Audio Out",
        "display": "IPS, 280Hz, 1ms",
        "features": " Free Sync, Flicker Free, Low Blue Light, G-Sync",
        "aspectRation": "1920x1080"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/monitor/asus/vp32uq/vp32uq-01-500x500.jpg",
      "productName": "Asus VP32UQ 31.5 inch 4K UHD IPS Monitor",
      "category": "Monitor",
      "description": "Asus VP32UQ Monitor comes with 31.5-inch, 4K UHD (3840 x 2160) resolution display with IPS 178Â° wide viewing angle for sharp and immersive visuals. It delivers sharp, detail and immersive viewing experience. 100% sRGB provides realistic colors and smoother gradation, to achieves seamlessly smooth gameplay. And you will get to enjoy sharp, detailed visuals. On top of that, more onscreen space for multitasking so you get more things done quickly.This monitor support HDR-10 to enhance bright and dark area. The Asus VP32UQ Monitor has DisplayPort, HDMI, built-in 2W x 2 stereo speakers. Here, the Adaptive-Sync technology to animated content with fast action and eliminate screen tearing. The ASUS Eye Care monitors feature TÃœV Rheinland-certified Flicker-free and Low Blue Light technologies to ensure a comfortable viewing experience. This monitor also supports both Adaptive-Sync with NVIDIA GeForce graphics cards and FreeSync with AMD Radeon graphics cards and also compatible with NVIDIA GeForce GTX 10 series, GTX 16 series, RTX 20 series and newer graphics cards. In this monitor, the Exclusive ASUS blue light filter protects you from harmful blue light, and It's easy to access, intuitive and flexible with seamless adjustment. The latest Asus VP32UQ 31.5 inch 4K UHD IPS Monitor has 03 years of warranty.",
      "price": "65000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "VP32UQ",
        "port": "1x HDMI, 1x DP",
        "display": "IPS, 60Hz, 4ms(GTG)",
        "features": "Free Sync, Eye Care, Flicker Free,100% RGB",
        "aspectRation": "16:9"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing monitor"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },

    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/corsair/470t-rgb/470t-rgb-500x500.jpg",
      "productName": "Corsair 470T RGB Mid-Tower Gaming Casing",
      "category": "Casing",
      "description": "The CORSAIR 470T RGB is a distinctive mid-tower ATX case with a spacious interior, striking RGB style, and great cooling. Combining a spacious interior, striking RGB style, and proven CORSAIR build quality, the 470T RGB is a great choice for your new high-performance PC. Offers sharp looks accented by an integrated RGB light strip, with mesh backing for strong intake airflow. Fits up to 7x 120mm or 4x 140mm cooling fans, along with multiple radiators including a 360mm in front or in the roof. Puts your connections within easy reach, including 2x USB 3.0 ports, a microphone jack, an audio jack, and push-button control of your front panel RGB lighting. Show off your high-profile components and RGB lighting.",
      "price": "3499",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "CORSAIR",
        "model": "Corsair 470T RGB",
        "dimensions": "495 x 477 x 213 mm",
        "type": "Mid-Tower Gaming Casing"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/antec/dp505-white/dp505-white-01-500x500.webp",
      "productName": "Antec DP505 White Mid-Tower E-ATX Gaming Case",
      "category": "Casing",
      "description": "The Antec DP505 White Mid-Tower E-ATX Gaming Case supports E-ATX, ATX, Micro-ATX, and ITX motherboards. It features an extensive interior and powerful compatibility. 2 x 360mm can be installed in the front & on the top simultaneously. This desktop PC gaming casing comes with a massive X-shaped mesh front panel and ventilation on the top, at the bottom, and in the PSU chamber, which will accelerate the airflow circulation and enhance the cooling performance. The Antec DP505 White comes with a Massive Mesh Front Panel with X-Shaped Design. There is a magnetic dust filter on the top and a pull-out dust filter at the bottom. It offers well-designed cable routing making wiring easy and simple, with a spacious 23mm of space for cables. It can fit up to 4 drives easily.",
      "price": "8900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "ANTEC",
        "model": "DP505 White",
        "dimensions": "481 x 220 x 490mm (DWH)",
        "type": "Mid Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/xigmatek/overtake/overtake-01-500x500.webp",
      "productName": "XIGMATEK Overtake Tempered Glass Rainbow RGB Super Tower EATX Gaming Case",
      "category": "Casing",
      "description": "XIGMATEK Overtake Super Tower EATX Gaming Case is a new generation Rainbow RGB PC case with front, left, and right tempered glass. This case chassis is designed for all major E-ATX, ATX, M-ATX gaming, or professional motherboard. It supports 180mm CPU Cooler clearance and 380mm VGA card. The XIGMATEK Overtake can support up to 11 x 120mm fan or liquid cooling radiators Front 480/360mm, MB side 280/240, and Rear 240/280mm for excellent cooling performance. The two-sided tempered glass design allows more air intake through front panel side vents. Three-sided tempered glass for best showing professional or gaming system build. The special chassis design of XIGMATEK Overtake is easy to do cable management and hides all the messy cables for a tidy display. Overtake especially comes with see-through tempered glass; it is a perfect choice to display how beautiful your system build will be. It supports up to 4x2.5' SSD Or 2x3.5' HDD+2 X 2.5' SSD W/O extend HDD Bay. The XIGMATEK Overtake comes with no warranty.",
      "price": "12400",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "XIGMATEK",
        "model": "Overtake",
        "dimensions": "485 x 247 x 566mm",
        "type": "Mid-Tower Gaming Casing"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/lian-li/o11-dynamic-mini/o11-dynamic-min-black-with-psu-500x500.jpg",
      "productName": "Lian Li O11D Mini-X O11 Dynamic MINI Black Mini-tower Gaming Case",
      "category": "Casing",
      "description": "The Lian Li O11D Mini-X O11 Dynamic MINI is a case that would accommodate the maximum number of water-cooling configurations without being oversized. The Lian Li O11D Mini-X O11 Dynamic MINI supports mini-ITX, micro-ATX, ATX, and E-ATX motherboard sizes. It comes with a modular back panel design, the user has the option to choose from 3 slots/ 5 slots/ 7 slots I/O shield to optimize the case to the configuration of the user’s choice. It supports up to 9 fans to cool the chassis. It comes with a blend of brushed aluminum and tempered glass. This casing has a high-quality feel and touches on the exterior.",
      "price": "24500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "Lian",
        "model": "O11 Dynamic MINI",
        "dimensions": "(D)420mm X (W)269.5mm X (H)380mm",
        "type": "Mini-Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/casing/thermaltake/level-20/level-20-01-500x500.webp",
      "productName": "Thermaltake Level 20 Tempered Glass Edition Full-Tower RGB Gaming Case",
      "category": "Casing",
      "description": "The Thermaltake Level 20 Tempered Glass Edition Full-Tower Gaming Case features an E-ATX full tower chassis with three tempered glass panes and three 140mm Riing Plus 14 RGB fans that come pre-installed. The Thermaltake Gaming Case features a ventilation-focused, trio-chamber design with tempered glass and a tool-less locking mechanism, quick transmission (USB Type-C and USB 3.0), TT Premium Gaming PCI-E 3.0 Riser Cable, and integration with cutting-edge' TT RGB PLUS software/voice-controlled with as well as three built-in Riing Plus 14 LED RGB Fans, two Lumi Plus LED Strips front and rear, and one Riing Plus Digital Controller. The Three Riing Plus 14 RGB Fans and two Lumi Plus LED Strips are incorporated in to improve airflow while lighting up Level 20 with 16.8 million distinctly beautiful illumination display colors. The Thermaltake tempered glass Full-Tower casing exclusive accreditation is only awarded to goods that meet the design and hardcore enthusiast standards that should be applied to a true LCS chassis. The Tt LCS certification was designed so that Thermaltake Full-Tower casing could identify which chassis have been tested to be best compatible with extreme liquid cooling systems, ensuring you get the highest performance from the best features and fitting. It has TT Premium is much more than a quality guarantee. Behind the name is a love of DIY and modding, as well as Thermaltake's case aim to be the most inventive company in the PC hardware market. The Thermaltake Level 20 case has TT RGB PLUS Ecosystem intelligent lighting solution for PCs that combines the most modern addressable LED lighting with Thermaltake's own TT RGB PLUS Software. The Thermaltake tempered glass Full-Tower Casing has aluminum panels developed by high-precision CNC digital cutting to assure chassis security while delivering a futuristic gaming spirit. To meet users' expectations, the bundled Thermaltake casing has TT Gaming PCI-E 3.0 Riser Cable features premium quality, ultra-high speed cable, and EMI shielding with a conductive polymer. The Thermaltake Casing Level 20 includes a USB Type-CTMI/O port with a 10G communication speed per port. There are also USB 3.0 I/O ports. The Thermaltake Level 20 Tempered Glass Edition Full-Tower RGB Gaming Case has no Warranty.",
      "price": "86500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "THERMALTAKE",
        "model": "Level 20",
        "dimensions": "732 x 280 x 688 mm",
        "type": "E-ATX Full Tower"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },

    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/fantech/g13-rhasta-ii-pro/g13-rhasta-ii-pro-001-500x500.jpg",
      "productName": "Fantech G13 Rhasta II Pro Gaming Mouse Black",
      "category": "Mouse",
      "description": "Fantech G13 Rhasta II Pro Gaming Mouse comes with Additional functions Game optical sensor. This gaming mouse has a maximum resolution of 2400 DPI, a Dedicated button for changing modes DPI â€œon the fly with 3 buttons + 1 scroll wheel/button. It's a scroll wheel built in Silicone & rubber materials. This gaming mouse is featured with 5 million keystrokes cycle buttons durability, 4 buttons, Cable in tissue braid, RGB lights, Low friction legs, and also suitable for right and left-handed users. This new Fantech Gaming mouse is compatible with Microsoft Windows, Mac OS, Linux, Chrome operating system. The Fantech G13 Rhasta II Pro Gaming Mouse has a 01-year warranty.",
      "price": "475",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "Fantech G13 Rhasta II Pro",
        "type": "USB Wired",
        "buttons": "3 buttons + 1 scroll wheel / button"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/imice/v6-gaming/v6-gaming-01-500x500.jpg",
      "productName": "IMICE V6 Professional Wired Gaming Mouse",
      "category": "Mouse",
      "description": "The IMICE V6 Professional Wired Gaming Mouse has 7 buttons, a 3200 DPI, multimedia capabilities, and LED lighting. Black-Grey. An outstanding mouse that was properly built for the demands of every gamer, but also high-requirement office work, comes with ergonomic design and great aesthetics, while its performance satisfies the needs of any user. With great accuracy and illumination of various combinations determined by the user, LED Breathing Light technology is used in conjunction with the appropriate software. The resolution is adjustable to four levels, each of which may be tailored to the user's specific needs. Additionally, with the use of software, each of the buttons may be assigned a distinct function according to any requirements. The design allows right-handed and left-handed users to have the same user experience, and there is a unique liner at the base of the mouse for smoother gliding on the surface. With a plug-and-play connection, it is compatible with any operating system. The IMICE V6 Professional Wired Gaming Mouse has 1200/1600/2400/3200 DPI resolution, 6 keys Frame rate 4000 frames per second, maximum speed 30 inches, per second Voltage 5V 100 mA and Rate-Frequency 125 Hz/s. This mouse comes with a 01-year warranty.",
      "price": "605",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IMICE",
        "model": "V6",
        "type": "Wired Gaming Mouse",
        "buttons": "6 buttons"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/fantech/vx7-crypto/vx7-crypto-sakura-edition-01-500x500.jpg",
      "productName": "Fantech VX7 Crypto Sakura Edition 6 Button USB Gaming Mouse",
      "category": "Mouse",
      "description": "The Fantech VX7 Crypto Sakura Edition is an ideal gaming mouse. The main feature of this model is its nice design and On-the-fly Adjustable Dpi(800-1200-1600-2400). Thanks to an innovative sensor equipped with a DPI mode switch, the mouse sensitivity range reaches about 2400 DPI. But sliding the mouse on the playing surface is almost perfect. The main change in this mouse is comprised of 6 buttons. The keys of this mouse have a 3 Million click lifetime. The Fantech VX7 Crypto Sakura Edition comes with a 1-year warranty.",
      "price": "1050",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "FANTECH",
        "model": "VX7 Crypto Sakura Edition",
        "type": "wired",
        "buttons": "6"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/logitech/g102-lightsync/g102-lightsync-01-500x500.webp",
      "productName": "Logitech G102 Lightsync RGB USB Gaming Mouse",
      "category": "Mouse",
      "description": "Logitech G102 Lightsync Mouse reports 1,000 times per second, 8x faster than standard mice. This means when the mouse is moved or clicked the onscreen response is virtually instantaneous. Play to your full potential with a mouse that offers 200 to 8,000 DPI delivering incredible accuracy, tracking speed, and consistency. LIGHTSYNC technology provides next-gen RGB lighting that synchronizes lighting and game profiles with your content. Customize from a full spectrum of approximately 16.8 million colors and synchronize lighting animations and effects with your other Logitech G devices. Customize it all quickly and easily using Logitech Gaming Software (LGS).On-the-fly DPI shifting between two sensitivity settings with a click, from pixel-precise 250 DPI targeting to speedy 2,500 DPI movement. Use LGS to customize the DPI settings to fit your style of play. Also, DPI cycling lets you choose from up to five DPI settings while in-game.System requirements are Windows 7 or later, macOS 10.11 or later, chrome OSTM, USB port, and internet access for Logitech Gaming Software (optional). Responsiveness data formats are 16 bits/axis, USB report rate: 1000 Hz (1ms), microprocessor 32-bit ARM.",
      "price": "1950",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G102 Lightsync",
        "type": "Wired",
        "buttons": "6 programmable buttons"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medimu budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/mouse/logitech/g502-hero/g502-hero-1-500x500.jpg",
      "productName": "Logitech G502 HERO High Performance RGB Gaming Mouse",
      "category": "Mouse",
      "description": "Logitech G502 HERO High Performance RGB Gaming Mouse is built in an advanced optical sensor for customizable RGB lighting, maximum tracking accuracy, custom game profiles with from 200 up to 16,000 DPI resolution.This gaming mouse provides High-performance HERO 16K Sensor which is more accurate in gaming speed. HERO 16K sensor is capable of 400+ IPS with zero smoothing, filtering or acceleration with achieves competition-level precision and the most consistent responsiveness ever. This exclusive mouse has 11 fully programmable buttons with Five 3.6G adjustable weight and save up to five ready-to-play profiles directly to the mouse. It is configurable in a variety of front, rear, left, right and center weighted configurations. In this G502 HERO mouse, there are 16.8 million colors and synchronize lighting animations which is effects with your other Logitech G devices. By using next generation RGB (LIGHTSYNC technology), it will deliver the most immersive RGB experience ever which is driven by games, audio, or your screen. This unique mouse has 50 million clicks of main buttons, > 250 kilometers PTFE Feet, > 40 G max. acceleration, > 400 IPS max. speed. Its responsive features are 16 bits/axis USB data format, 1000 Hz (1ms) USB report rate, 32-bit ARM Microprocessor. The HERO RGB Gaming Mouse is compatible with Windows 7 or later, macOS 10.11 or later, Chrome OS, USB port and (Optional) Internet access for Logitech G HUB (G HUB). Experiment with the alignment and balance to find the sweet spot to optimize your gaming performance. This exclusive gaming mouse has 02 years of warranty.",
      "price": "4700",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G502 HERO",
        "type": "Wired USB",
        "buttons": "50 million click"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard mouse"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },

    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/imice/gk-700/gk-700-01-500x500.jpg",
      "productName": "IMICE GK-700 USB RGB Gaming Keyboard",
      "category": "Keyboard",
      "description": "The IMICE GK-700 Gaming Keyboard is meant to be waterproof. The carter key seat diversion hole design efficiently prevents fluids from splashing into the body while being safe and dependable. The keyboard's metal plate is intended to store small things such as mobile phones and pencils. The IMICE GK-700 USB RGB Gaming Keyboard casing is composed of frosted aluminum to prevent the violent gaming operation from slipping. This keyboard has a multicolored changeable backlight and laser engraved keycaps, allowing the characters to see even in the dark. This ergonomic arc key design has adjustable foot support and a smooth operation. The IMICE GK-700 Gaming Keyboard comes with a 01-year warranty.",
      "price": "1200",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "IMICE",
        "model": "GK-700",
        "type": "RGB Gaming",
        "color": "Black",
        "dimension": "470x180x38mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/dareu/a87-alpha/a87-alpha-01-500x500.jpg",
      "productName": "Dareu A87 Alpha Tenkeyless Red Cherry MX Switch Mechanical Keyboard",
      "category": "Keyboard",
      "description": "Dareu A87 Alpha Tenkeyless Mechanical Keyboard equipped with Cherry MX Mechanical Switch that can hold up until 50 Million Clicks. This Tenkeyless Mechanical Keyboard is featured with Switch: Red Cherry MX Mechanical Switch, Key Fields: 3 Blocks, Cherry MX Mechanical Switch, Detachable Top Cover, PBT Material Keycaps & N-Key Rollover, USB Type-C Interfaced, Adjustable Effect Ice Blue Light. Here, the top cover can be detachable. It is convenient to disassemble cleaning and replacement. In this keyboard, Wear resistance character and it will not cause greasy hand feeling, and also support N-Key Rollover to avoid ghosting. It is compatible with Windows XP/Win 7/Win 8/Win 10 operating system. This latest Dareu A87 Alpha Tenkeyless Mechanical Keyboard has 1 Year Official Warranty.",
      "price": "5800",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "DAREU",
        "model": "A87 Alpha",
        "type": "Mechanical",
        "color": "Black",
        "dimension": "359 x 136 x 36mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/logitech/g-613/g-613-black-1-500x500.jpg",
      "productName": "Logitech G613 Wireless Mechanical Gaming Keyboard",
      "category": "Keyboard",
      "description": "G613 is a next generation wireless keyboard designed for gamers who demand both the high performance capabilities of mechanical switches and the freedom of wireless gaming. Through end-to-end engineering and design, Logitech G developed a robust wireless solution to solve the fundamental problems of latency, stability, and connectivity. The end result is LIGHTSPEED, a pro-grade wireless solution, that achieves wired-like performance. Romer-G Tactile switches deliver quiet, precise mechanical performance with incredible feel and durability with 70M click-life. The choice of top esports professionals, Romer-G Tactile switches have a short-throw actuation at 1.5 mm which means 25% faster 11.5 mm vs 2.0 mm actuation distance on standard mechanical switches. keystrokes than the competitionâ€™s standard mechanical switches. Romer-G is a perfect blend of speed, precision and quiet performance while still maintaining a discernible, tactile actuation feel. Six dedicated G-keys can be programmed with custom macros and in-app commands. Execute complex actions, simply and quickly, with a keystroke. G-keys can be assigned per game or app profile for customizability and convenience. Use Logitech G HUB to easily setup and manage profiles, commands and more. Connect to LIGHTSPEED wireless for super fast 1 ms report rate or swap to another device with the push of a button using Bluetooth connectivity. Toggle between high-performance LIGHTSPEED wireless via USB receiver and Bluetoothâ€” quickly and easily. Using only 2 AA batteries, G613 can be used for up to 18 months. Battery life may vary based on your usage and computing conditions.. When battery is at 15%, both the LED status indicator light on the keyboard and Logitech G HUB notifications will warn you before the critical moment hits. Pair G613 wireless mechanical keyboard with G603 wireless gaming mouse to acquire the complete wireless desktop solution. G603 features our next generation HERO sensor, LIGHTSPEED wireless, Hi-Lo power management system and more high performance features that gaming enthusiasts demand.",
      "price": "8900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "LOGITECH",
        "model": "Logitech G613",
        "type": "Bluetooth",
        "color": "Gray",
        "dimension": "Height: 478 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/razer/huntsman-mini/huntsman-mini-1-500x500.jpg",
      "productName": "Razer Huntsman Mini 60% Optical Gaming Keyboard Purple Switch",
      "category": "Keyboard",
      "description": "The Razer Huntsman Mini is a 60% gaming keyboard with cutting-edge Purple Razer Optical Switches, which is highly portable and ideal for streamlined setups, itâ€™s time to experience lightning-fast actuation in our most compact form factor yet. It is the go-to choice for gamers who prefer receiving crisp, tactile feedback that sounds as satisfying as it feels.This gaming Keyboard offers faster, lighter, and smoother actuation than mechanical switches, and lasts longer as it requires fewer moving parts that operate with less friction. This gaming keyboard is designed for greater durability, the keycaps on this 60% gaming keyboard have a premium, textured quality thatâ€™ll never degrade to a shiny finish or have their labeling wear off with intense use. For easier reference when executing commands and hotkeys, side-printed secondary functions have also been added. This exclusive gaming keyboard comes with 01 year warranty (Need to submit product box for warranty claim).",
      "price": "14000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "RAZER",
        "model": "Razer Huntsman Mini",
        "type": "60% Gaming Keyboard with Razer Optical Switch",
        "color": "Black and Mercury",
        "dimension": "462 X 155 X 39 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing keyboard"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/keyboard/asus/rog-claymore-ii/rog-claymore-ii-01-500x500.jpg",
      "productName": "Asus ROG CLAYMORE II Modular TKL Mechanical Blue Switch Gaming Keyboard",
      "category": "Keyboard",
      "description": "The Asus ROG CLAYMORE II is a gaming mechanical keyboard with ROG RX Optical Mechanical Switches, detachable Numpad & wrist rest, wired & wireless 2.4G modes, extra customizable clicky hotkeys, volume control wheel, and wireless Aura Sync. The ROG CLAYMORE II delivers a host of features designed to give you exciting new ways to play. Create your ideal gaming setup by placing the new detachable Numpad on whichever side you prefer; then choose between wired or wireless mode and light it all up with Aura Sync. The detachable Numpad can be attached on either side of the keyboard, or it can be removed entirely if you prefer to use ROG Claymore II in TKL mode (80%). ROG RX Blue Optical Mechanical Switches offer consistent, wobble-free keystrokes with a superfast 1 ms response and 100-million-keystroke lifespan. ROG PBT Doubleshot Keycaps provide a unique and premium feel, as well as offer long-lasting durability. A 4000 mAh battery and energy-efficient design give you up to 43 hours of nonstop gaming in wireless mode on a single charge, even with RGB lighting on. 30 minutes of USB-C fast charging allows ROG Claymore II to be operated for up to 18 hours (lighting off). The detachable Numpad includes four media control keys that can be programmed into hotkeys for convenient productivity shortcuts or macro in-game commands. Thereâ€™s even a built-in control wheel for quick volume adjustment. With wireless Aura Sync RGB, the entire color spectrum and a range of dynamic lighting effects are at your command. Individually lit keys allow you to create a keyboard thatâ€™s uniquely yours. The Asus ROG CLAYMORE II comes with a 1-year replacement warranty.",
      "price": "23500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ASUS",
        "model": "ROG CLAYMORE II",
        "type": "Mechanical Gaming",
        "color": "Black",
        "dimension": "462 X 155 X 39 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard casing"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },

    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/zotac/geforce-rtx-3050-solo/geforce-rtx-3050-solo-01-500x500.webp",
      "productName": "ZOTAC GAMING GeForce RTX 3050 Solo 8GB GDDR6 Graphics Card",
      "category": "Gpu",
      "description": "",
      "price": "29500",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "ZOTAC",
        "model": "GAMING GeForce RTX 3050 Solo",
        "coreClock": "Boost: 1777 MHz",
        "memoryClock": "14 Gbps",
        "busType": "128-bit",
        "dimension": "168mm x 132.2mm x 39.8mm / 6.6' x 5.2' x 1.6'"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for low budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/geforce-rtx-3070-eagle/geforce-rtx-3070-eagle-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX 3070 EAGLE 8GB GDDR6 Graphics Card",
      "category": "Gpu",
      "description": "",
      "price": "75000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX 3070 EAGLE",
        "coreClock": "1725 MHz",
        "memoryClock": "14000 MHz",
        "busType": "256 bit",
        "dimension": "282 x 115 x 41 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is an amazing graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for medium budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/msi/geforce-rtx-4070-ti-gaming-x-trio-white-12g/geforce-rtx-4070-ti-gaming-x-trio-white-12g-01-500x500.webp",
      "productName": "MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12GB GDDR6X Graphics Card",
      "category": "Gpu",
      "description": "The MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G Graphics Card brings an enormous leap in performance, efficiency, and AI-powered graphics. It lets you experience ultra-high-performance gaming, incredibly detailed virtual worlds with ray tracing, unprecedented productivity, and new ways to create. It’s powered by the NVIDIA Ada Lovelace architecture and comes with 12 GB of G6X memory to deliver the ultimate experience for gamers and creators. The MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G features TRI FROZR 3 Thermal Design. Fan blades linked by ring arcs and a fan cowl work together to stabilize and maintain high-pressure airflow. The heat from the GPU and memory modules is captured by a copper baseplate and then rapidly transferred to Core Pipes. The heat from the GPU and memory modules is immediately captured by a solid nickel-plated copper baseplate and then rapidly transferred to an array of heat pipes. This widening of the thermal transfer systems with highly efficient mechanisms improves overall efficiency. Fins with a V-shaped cutout are located at the airflow passthrough to improve flow efficiency. MSI GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G comes with Dual BIOS that gives you the choice to prioritize full performance in GAMING mode or low noise in SILENT mode. It comes with a bundled support bracket that can be attached to your PC case for additional graphics card reinforcement.",
      "price": "126900",
      "status": "Out of Stoke",
      "rating": 5,
      "keyFeatures": {
        "brand": "MSI",
        "model": "GeForce RTX 4070 Ti GAMING X TRIO WHITE 12G",
        "coreClock": "Extreme Performance: 2760 MHz (MSI Center)",
        "memoryClock": "21 Gbps",
        "busType": "192-bit",
        "dimension": "337 x 140 x 62 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphich card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/rtx-4070-ti-gaming-oc-12g/geforce-rtx-4070-ti-gaming-oc-12g-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX­­ 4070 Ti GAMING OC 12GB GDDR6X Graphics Card",
      "category": "Gpu",
      "description": "The GIGABYTE GeForce RTX 4070 Ti GAMING OC is a powerful graphics card for gaming and demanding multimedia applications. It comes with a core clock speed of 2640 MHz and it features 7680 CUDA cores and 12 GB of GDDR6X memory with a clock speed of 21 Gbps and a 192-bit memory bus. The card is PCI-E 4.0 compliant and can support digital resolutions of up to 7680x4320. It also has 3 DisplayPort 1.4 outputs and 1 HDMI 2.1 output. It has 4 multi-view capabilities and measures 336mm in length, 140mm in width, and 58mm in height. It has an ATX PCB form factor and is compatible with DirectX 12 Ultimate and OpenGL 4.6. A recommended power supply of 750W is required, and the card has a single 16-pin power connector. ",
      "price": "128000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX­­ 4070 Ti GAMING OC 12G",
        "coreClock": "2640 MHz (Reference card : 2610 MHz)",
        "memoryClock": "21 Gbps",
        "busType": "192 bit",
        "dimension": "L=336 W=140 H=58 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphics card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for high budget"
        }
      ]
    },
    {
      "image": "https://www.startech.com.bd/image/cache/catalog/graphics-card/gigabyte/geforce-rtx-4080-16gb-gaming-oc/geforce-rtx-4080-16gb-gaming-oc-01-500x500.webp",
      "productName": "GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card",
      "category": "Gpu",
      "description": "The GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card, based on the Ada Lovelace architecture and designed to handle the graphical demands of 8K gaming and high frame rates, brings the power of real-time ray tracing and AI to your PC games. The GPU has 16GB of GDDR6X VRAM and a 256-bit memory interface, which provides better performance and power efficiency than the previous Ampere-based iteration. The card's front panel includes several outputs, including DisplayPort 1.4a and HDMI 2.1. HDMI 2.1 provides up to 48 Gb/s bandwidth and a variety of higher resolutions and refresh rates, including 8K at 60 frames per second, 4K at 120 frames per second, and even 10K. The RTX 4080 is about more than simply high-resolution gaming. Computationally intensive programs can use the 9728 cores of the GPU to expedite processes using CUDA and other APIs. Gigabyte used the WINDFORCE cooling technology for cooling. The three fans rotate in opposite directions to decrease turbulence and boost airflow pressure. When the GPU is running a low-load or low-power game, the 3D Active Fan provides semi-passive cooling, and the fans turn off. The triangle fan edge splits the airflow, which is then steered smoothly along the 3D stripe curve on the fan surface. The graphene nano lubricant can improve the life of the fans while also making them quieter. It also offers RGB Fusion, which includes color customization and a range of lighting effects. It may also be used to sync with other AORUS devices. The GIGABYTE GeForce RTX 4080 16GB GAMING OC GDDR6X Graphics Card comes with a 02-year warranty.",
      "price": "181000",
      "status": "In Stock",
      "rating": 5,
      "keyFeatures": {
        "brand": "GIGABYTE",
        "model": "GeForce RTX 4080 16GB GAMING OC",
        "coreClock": "2535 MHz (Reference Card: 2505 MHz)",
        "memoryClock": "22.4 Gbps",
        "busType": "256 bit",
        "dimension": "L=342 W=150 H=75 mm"
      },
      "individualRating": 5,
      "averageRating": 4,
      "reviews": [
        {
          "email": "example@gmail.com",
          "reviewText": "This is a standard graphich card"
        },
        {
          "email": "example@gmail.com",
          "reviewText": "This one is good one for extream budget"
        }
      ]
    }
]

